{
  "documents": [
    "Chương 3\nCHỦ NGHĨA XÃ HỘI VÀ\nTHỜI KỲ QUÁ ĐỘ LÊN CHỦ NGHĨA XÃ HỘI\nA. MỤC TIÊU\n1. Về kiến thức: Sinh viên nắm được những quan điểm của chủ nghĩa Mác -\nLênin về chủ nghĩa xã hội, thời kỳ quá độ lên chủ nghĩa xã hội và sự vận dụng sáng \ntạo của Đảng Cộng sản Việt Nam vào điều kiện cụ thể Việt Nam.\n2. Về kỹ năng: Sinh viên bước đầu biết vận dụng những tri thức có được vào \nphân tích những vấn đề cơ bản về chủ nghĩa xã hội và con đường đi lên chủ nghĩa xã \nhội ở Việt Nam hiện nay.\n3. Về tư tưởng: sinh viên khẳng định niềm tin vào chế độ xã hội chủ nghĩa, luôn \ntin và ủng hộ đường lối đổi mới theo định hướng xã hội chủ nghĩa dưới sự lãnh đạo \ncủa Đảng Cộng sản Việt Nam. \nB. NỘI DUNG\n1. Chủ nghĩa xã hội \nChủ nghĩa xã hội (tiếng Anh: Socialism) được hiểu theo bốn nghĩa:1) Là phong \ntrào thực tiễn, phong trào đấu tranh của nhân dân lao động chống lại áp bức, bất công, \nchống các giai cấp thống trị; 2) Là trào lưu tư tưởng, lý luận phản ánh lý tưởng giải \nphóng nhân dân lao động khỏi áp bức, bóc lột, bất công; 3) Là một khoa học - Chủ\nnghĩa xã hội khoa học, khoa học về sứ mệnh lịch sử của giai cấp công nhân; 4) Là một \nchế độ xã hội tốt đẹp, giai đoạn đầu của hình thái kinh tế- xã hội cộng sản chủ nghĩa.\n1.1. Chủ nghĩa xã hội, giai đoạn đầu của hình thái kinh tế - xã hội cộng sản chủ nghĩa \nCác nhà sáng lập chủ nghĩa xã hội khoa học, C.Mác Ph.Ăngghen khi nghiên \ncứu lịch sử phát triển của xã hội loài người, nhất là lịch sử xã hội tư bản đã xây dựng \nnên học thuyết về hình thái kinh tế- xã hội. Học thuyết vạch rõ những qui luật cơ bản \ncủa vận động xã hội, chỉ ra phương pháp khoa học để giải thích lịch sử. Học thuyết hình \nthái kinh tế- xã hội của C. Mác không chỉ làm rõ những yếu tố cấu thành hình thái kinh \ntế- xã hội mà còn xem xét xã hội trong quá trình biến đổi và phát triển không ngừng.\nHọc thuyết về hình thái kinh tế - xã hội do C.Mác và Ph.Ăngghen khởi xướng \nđược V.I.Lênin bổ sung, phát triển và hiện thực hoá trong công cuộc xây dựng chủ\nnghĩa xã hội ở nước Nga Xô viết trở thành học thuyết hình thái kinh tế - xã hội của chủ\nnghĩa Mác- Lênin, tài sản vô giá của nhân loại. \nHọc thuyết hình thái kinh tế - xã hội của chủ nghĩa Mác - Lênin đã chỉ ra tính \ntất yếu sự thay thế hình thái kinh tế- xã hội tư bản chủ nghĩa bằng hình thái kinh tế - xã \n48\n49\nhội cộng sản chủ nghĩa, đó là quá trình lịch sử - tự nhiên. Sự thay thế này được thực \nhiện thông qua cách mạng xã hội chủ nghĩa xuất phát từ hai tiền đề vật chất quan trọng \nnhất là sự phát triển của lực lượng sản xuất và sự trưởng thành của giai cấp công nhân. \nHọc thuyết hình thái kinh tế - xã hội của chủ nghĩa Mác - Lênin đã cung cấp \nnhững tiêu chuẩn thực sự duy vật, khoa học cho sự phân kỳ lịch sử, trong đó có sự\nphân kỳ hình thái kinh tế - xã hội cộng sản chủ nghĩa. \nKhi phân tích hình thái kinh tế - xã hội cộng sản chủ nghĩa, C.Mác và \nPh.Ăngghen cho rằng, hình thái kinh tế - xã hội cộng sản chủ nghĩa phát triển từ thấp \nlên cao qua hai giai đoạn, giai đoạn thấp và giai đoạn cao, giai đoạn cộng sản chủ\nnghĩa; giữa xã hội tư bản chủ nghĩa và xã hội cộng sản chủ nghĩa là thời kỳ quá độ lên \nchủ nghĩa cộng sản. Trong tác phẩm “Phê phán cương lĩnh Gôta” (1875) C.Mác đã cho \nrằng: “Giữa xã hội tư bản chủ nghĩa và xã hội cộng sản chủ nghĩa là một thời kỳ cải \nbiến cách mạng từ xã hội này sang xã hội kia. Thích ứng với thời kỳ ấy là một thời kỳ\nquá độ chính trị, và nhà nước của thời kỳ ấy không thể là cái gì khác hơn là nền \nchuyên chính cách mạng của giai cấp vô sản”1\n. Khẳng định quan điểm của C. Mác,",
    "V.I. Lênin cho rằng: “Về lý luận, không thể nghi ngờ gì được rằng giữa chủ nghĩa tư \nbản và chủ nghĩa cộng sản, có một thời kỳ quá độ nhất định”2\n. \nVề xã hội của thời kỳ quá độ, C. Mác cho rằng đó là xã hội vừa thoát thai từ xã \nhội tư bản chủ nghĩa, xã hội chưa phát triển trên cơ sở của chính nó còn mang nhiều \ndấu vết của xã hội cũ để lại: “Cái xã hội mà chúng ta nói ở đây không phải là một xã \nhội cộng sản chủ nghĩa đã phát triển trên cơ sở của chính nó, mà trái lại là một xã hội \ncộng sản chủ nghĩa vừa thoát thai từ xã hội tư bản chủ nghĩa, do đó là một xã hội về mọi \nphương diện - kinh tế, đạo đức, tinh thần - còn mang những dấu vết của xã hội cũ mà nó \nđã lọt lòng ra”3\n. \nSau này, từ thực tiễn nước Nga, V. I Lênin cho rằng, đối với những nước chưa \ncó chủ nghĩa tư bản phát triển cao “cần phải có thời kỳ quá độ khá lâu dài từ chủ nghĩa \ntư bản lên chủ nghĩa xã hội”4\n. \nVậy là, về mặt lý luận và thực tiễn, thời kỳ quá độ từ chủ nghĩa tư bản lên chủ\nnghĩa cộng sản, được hiểu theo hai nghĩa: thứ nhất, đối với các nước chưa trải qua chủ\nnghĩa tư bản phát triển, cần thiết phải có thời kỳ quá độ khá lâu dài từ chủ nghĩa tư bản \nlên chủ nghĩa xã hội- những cơn đau đẻ kéo dài5\n; thứ hai, đối với những nước đã trải \nqua chủ nghĩa tư bản phát triển, giữa chủ nghĩa tư bản và chủ nghĩa cộng sản có một \nthời kỳ quá độ nhất định, thời kỳ cải biến cách mạng từ xã hội này sang xã hội kia, \n1 C.Mác và Ph.Ăngghen, Toàn tập, Nxb. CTQG, H. 1995, tập 19, tr.47.\n2 V.I.Lênin, Toàn tập, Nxb. Tiến bộ, Matxcơva. 1977, tập. 39, tr. 309-310.\n3 C.Mác và Ph.Ăngghen, Toàn tập, Nxb. CTQG, H. 1995, tập 19, tr.33 .\n4 V.I Lênin , Sdd, 1977, t 38, tr 464.\n5 Xem : V. I.Lênin, Sdd, 1976, tập 33, tr223.\n50\nthời kỳ quá độ từ chủ nghĩa tư bản lên chủ nghĩa cộng sản. \n1.2. Điều kiện ra đời chủ nghĩa xã hội \nBằng lý luận hình thái kinh tế - xã hội, C.Mác đã đi sâu phân tích, tìm ra qui \nluật vận động của hình thái kinh tế - xã hội tư bản chủ nghĩa, từ đó cho phép ông dự\nbáo khoa học về sự ra đời và tương lai của hình thái kinh tế - xã hội cộng sản chủ\nnghĩa. V.I Lênin cho rằng: C.Mác xuất phát từ chỗ là chủ nghĩa cộng sản hình thành từ\nchủ nghĩa tư bản, phát triển lên từ chủ nghĩa tư bản là kết quả tác động của một lực \nlượng xã hội do chủ nghĩa tư bản sinh ra - giai cấp vô sản, giai cấp công nhân hiện đại.\nCác nhà sáng lập chủ nghĩa xã hội khoa học đã thừa nhận vai trò to lớn của chủ\nnghĩa tư bản khi khẳng định: sự ra đời của chủ nghĩa tư bản là một giai đoạn mới trong \nlịch sử phát triển mới của nhân loại. Nhờ những bước tiến to lớn của lực lượng sản \nxuất, biểu hiện tập trung nhất là sự ra đời của công nghiệp cơ khí (Cách mạng công \nnghiệp lần thứ 2), chủ nghĩa tư bản đã tạo ra bước phát triển vượt bậc của lực lượng \nsản xuất. Trong vòng chưa đầy một thế kỷ, chủ nghĩa tư bản đã tạo ra được một lực \nlượng sản xuất nhiều hơn và đồ sộ hơn lực lượng sản xuất mà nhân loại tạo ra đến lúc\nđó1\n. Tuy nhiên, các ông cũng chỉ ra rằng, trong xã hội tư bản chủ nghĩa, lực lượng sản \nxuất càng được cơ khi hóa, hiện đại hóa càng mang tính xã hội hóa cao, thì càng mâu \nthuẫn với quan hệ sản xuất tư bản chủ nghĩa dựa trên chế độ chiếm hữu tư nhân tư bản\nchủ nghĩa. Quan hệ sản xuất từ chỗ đóng vai trò mở đường cho lực lượng sản xuất phát \ntriển, thì ngày càng trở nên lỗi thời, xiềng xích của lực lượng sản xuất. Mâu thuẫn giữa \ntính chất xã hội hóa của lực lượng sản xuất với chế độ chiếm hữu tư nhân tư bản chủ\nnghĩa đối với tư liệu sản xuất trở thành mâu thuẫn kinh tế cơ bản của chủ nghĩa tư bản, \nbiểu hiện về mặt xã hội là mâu thuẫn giữa giai cấp công nhân hiện đại với giai cấp tư \nsản lỗi thời. Cuộc đấu tranh giữa giai cấp công nhân và giai cấp tư sản xuất hiện ngay \ntừ đầu và ngày càng trở nên gay gắt và có tính chính trị rõ rét. C. Mác và Ph. Angghen \nchỉ rõ: “Từ chỗ là những hình thức phát triển của các lực lượng sản xuất, những quan \nhệ sản xuất ấy trở thành những xiềng xích của các lực lượng sản xuất. Khi đó bắt đầu \nthời đại môt cuộc cách mạng”2\n.\nHơn nữa, cùng với sự phát triển mạnh mẽ của nền đại công nghiệp cơ khí là sự\ntrưởng thành vượt bậc cả về số lượng và chất lượng của giai cấp công nhân, con để của \nnền đại công nghiệp. Chính sự phát triển về lực lượng sản xuất và sự trưởng thành của \ngiai cấp công nhân là tiền đề kinh tế- xã hội dẫn tới sự sụp đổ không tránh khỏi của \nchủ nghĩa tư bản. Diễn đạt tư tưởng đó, C.Mác và Ph.Ăngghen cho rằng, giai cấp tư \nsản không chỉ tạo vũ khí để giết mình mà còn tạo ra những người sử dụng vũ khí đó, \nnhững công nhân hiện đại, những người vô sản\n3\n. Sự trưởng thành vượt bậc và thực sự\n1 C.Mác và Ph.Ăngghen, Toàn tập, Nxb. CTQG, H. 1995, tập 4, tr.603.\n2 C.Mác và Ph.Ăngghen, Toàn tập, Nxb. CTQG, H. 1995, tập 3, tr.15.\n3 C.Mác và Ph.Ăngghen, Toàn tập, Nxb. CTQG, H. 1995, tập 4, tr.605.\ncủa giai cấp công nhân được đánh dấu bằng sự ra đời của Đảng cộng sản, đội tiền \nphong của giai cấp công nhân, trực tiếp lãnh đạo cuộc đấu tranh chính trị của giai cấp \ncông nhân chống giai cấp tư sản.\nSự phát triển của lực lượng sản xuất và sự trưởng thành thực sự của giai cấp \ncông nhân là tiền đề, điều kiện cho sự ra đời của hình thái kinh tế- xã hội cộng sản chủ\nnghĩa. Tuy nhiên, do khác về bản chất với tất cả các hình thái kinh tế - xã hội trước đó, \nnên hình thái kinh tế - xã hội cộng sản chủ nghĩa không tự nhiên ra đời, trái lại, nó chỉ\nđược hình thành thông qua cách mạng vô sản dưới sự lãnh đạo của đảng của giai cấp \ncông nhân - Đảng Cộng sản, thực hiện bước quá độ từ chủ nghĩa tư bản lên chủ nghĩa \nxã hội và chủ nghĩa cộng sản. \nCách mạng vô sản là cuộc cách mạng của giai cấp công nhân và nhân dân lao \nđộng dưới sự lãnh đạo của Đảng Cộng sản, trên thực tế được thực hiện bằng con \nđường bạo lực cách mạng nhằm lật đổ chế độ tư bản chủ nghĩa, thiết lập nhà nước \nchuyên chính vô sản, thực hiện sự nghiệp cải tạo xã hội cũ, xây dựng xã hội mới, xã \nhội xã hội chủ nghĩa và cộng sản chủ nghĩa. Tuy nhiên, cách mạng vô sản, về mặt lý \nthuyết cũng có thể được tiến hành bằng con đường hòa bình, nhưng vô cùng hiếm, quí \nvà trên thực tế chưa xảy ra.\nDo tính sâu sắc và triệt để của nó, cách mạng vô sản chỉ có thể thành công, hình \nthái kinh tế- xã hội cộng sản chủ nghĩa chỉ có thể được thiết lập và phát triển trên cơ sở\ncủa chính nó, một khi tính tích cực chính trị của giai cấp công nhân được khơi dậy và \nphát huy trong liên minh với các giai cấp và tầng lớp những người lao động dưới sự\nlãnh đạo của Đảng Cộng sản. \n1.3. Những đặc trưng cơ bản của chủ nghĩa xã hội \nKhi nghiên cứu về hình thái kinh tế - xã hội cộng sản chủ nghĩa, các nhà sáng \nlập chủ nghĩa xã hội khoa học rất quan tâm dự báo những đặc trưng của từng giai \nđoạn, đặc biệt là giai đoạn đầu (giai đoạn thấp) của xã hội cộng sản nhằm định \nhướng phát triển cho phong trào công nhân quốc tế. Những đặc trưng cơ bản của \ngiai đoạn đầu, phản ánh bản chất và tính ưu việt của chủ nghĩa xã hội từng bước \nđược bộc lộ đầy đủ cùng với quá trình xây dựng xã hội xã hội chủ nghĩa. Căn cứ vào\nnhững dự báo của C.Mác và Ph.Ăngghen và những quan điểm của V.I.Lênin về chủ\nnghĩa xã hội ở nước Nga xô - viết, có thể khái quát những đặc trưng cơ bản của chủ\nnghĩa xã hội như sau:\nMột là, chủ nghĩa xã hội giải phóng giai cấp, giải phóng dân tộc, giải phóng xã\nhội, giải phóng con người, tạo điều kiện để con người phát triển toàn diện.\nTrong tác phẩm Tuyên ngôn của Đảng Cộng sản, khi dự báo về xã hội tương lai, \nxã hội cộng sản chủ nghĩa, C.Mác và Ph.Ăngghen đã khẳng định: “Thay cho xã hội tư \nbản cũ, với những giai cấp và đối kháng giai cấp của nó, sẽ xuất hiện một liên hợp, trong\n51\n52\nđó sự phát triển tự do của mỗi người là điều kiện phát triển tự do của tất cả mọi người”\n1\n; \nkhi đó “con người, cuối cùng làm chủ tồn tại xã hội của chính mình, thì cũng do đó \nlàm chủ tự nhiên, làm chủ cả bản thân mình trở thành người tự do”2.\n. Đây là sự khác \nbiệt về chất giữa hình thái kinh tế - xã hội cộng sản chủ nghĩa so với các hình thái kinh\ntế - xã hội ra đời trước, thể hiện ở bản chất nhân văn, nhân đạo, vì sự nghiệp giải phóng\ngiai cấp, giải phóng xã hội, giải phóng con người. Đương nhiên, để đạt được mục tiêu \ntổng quát đó, C.Mác và Ph.Ăngghen cho rằng, cách mạng xã hội chủ nghĩa phải tiến \nhành triệt để, trước hết là giải phóng giai cấp, xóa bỏ tình trạng giai cấp này bóc lột, áp \nbức giai cấp kia, và một khi tình trạng người áp bức, bọc lột người bị xóa bỏ thì tình \ntrạng dân tộc này đi bóc lột dân tộc khác cũng bị xóa bỏ”\n3\n.",
    "V.I.Lênin, trong điều kiện mới của đời sống chính trị - xã hội thế giới đầu thế\nkỷ XX, đồng thời từ thực tiễn của công cuộc xây dựng chủ nghĩa xã hội ở nước Nga xô \n- viết đã cho rằng, mục đích cao nhất, cuối cùng của những cải tạo xã hội chủ nghĩa là \nthực hiện nguyên tắc: làm theo năng lực, hưởng theo nhu cầu: “khi bắt đầu những cải\ntạo xã hội chủ nghĩa, chúng ta phải đặt rõ cái mục đích mà những cải tạo xã hội chủ\nnghĩa đó rút cục nhằm tới, cụ thể là thiết lập một xã hội cộng sản chủ nghĩa, một xã hội\nkhông chỉ hạn chế ở việc tước đoạt các công xưởng, nhà máy, ruộng đất và tư liệu\nsản xuất, không chỉ hạn chế ở việc kiểm kê, kiểm soát một cách chặt chẽ việc sản xuất\nvà phân phối sản phẩm, mà còn đi xa hơn nữa, đi tới việc thực hiện nguyên tắc: làm\ntheo năng lực, hưởng theo nhu cầu. Vì thế cái tên gọi “Đảng Cộng sản là duy nhất \nchính xác về mặt khoa học”\n4 V.I.Lênin cũng khẳng định mục đích cao cả của chủ nghĩa\nxã hội cần đạt đến là xóa bỏ sự phân chia xã hội thành giai cấp, biến tất cả thành viên\ntrong xã hội thành người lao động, tiêu diệt cơ sở của mọi tình trạng người bóc lột\nngười. V.I.Lênin còn chỉ rõ trong quá trình phấn đấu để đạt mục đích cao cả đó, giai\ncấp công nhân, chính Đảng Cộng sản phải hoàn thành nhiều nhiệm vụ của các giai\nđoạn khác nhau, trong đó có mục đích, nhiệm vụ cụ thể của thời kỳ xây dựng chủ nghĩa \nxã hội - tạo ra các điều kiện về cơ sở vật chất - kỹ thuật và đời sống tinh thần để thiết lập \nxã hội cộng sản. \nHai là, chủ nghĩa xã hội là xã hội do nhân dân lao động làm chủ\nĐây là đặc trưng thể hiện thuộc tính bản chất của chủ nghĩa xã hội, xã hội vì\ncon người và do con người; nhân dân mà nòng cốt là nhân dân lao động là chủ thể của \nxã hội thực hiện quyền làm chủ ngày càng rộng rãi và đầy đủ trong quá trình cải tạo xã \nhội cũ, xây dựng xã hội mới. Chủ nghĩa xã hội là một chế độ chính trị dân chủ, nhà\nnước xã hội chủ nghĩa với hệ thống pháp luật và hệ thống tổ chức ngày càng ngày\n1 C. Mác và Ph.Ăngghen, Toàn tập, Nxb. CTQG, H.1995, tập. 4, tr.628.\n2 C.Mác và Ph.Ăngghen, Toàn tập, Nxb. CTQG, H. 1995, tập. 4, tr.33.\n3 C.Mác và Ph.Ăngghen, Toàn tập, Nxb. CTQG, H. 1995, tập.4, tr.624.\n4 V.I.Lênin, Toàn tập, Nxb Tiến bộ, Mátxcơva, 1976, tập 36, tr.57.\n53\ncàng hoàn thiện sẽ quản lý xã hội ngày càng hiệu quả. C.Mác và Ph.Ăngghen đã\nchỉ rõ: “… bước thứ nhất trong cách mạng công nhân là giai cấp vô sản biến thành\ngiai cấp thống trị là giành lấy dân chủ”\n1\n. V.I.Lênin, từ thực tiễn xây dựng chủ nghĩa\nxã hội ở nước Nga Xô viết đã coi chính quyền Xô viết là một kiểu Nhà nước chuyên\nchính vô sản, một chế độ dân chủ ưu việt gấp triệu lần so với chế độ dân chủ tư sản: \n“Chế độ dân chủ vô sản so với bất kỳ chế độ dân chủ tư sản nào cũng dân chủ hơn gấp\ntriệu lần; chính quyền Xô viết so với nước cộng hoà dân chủ nhất thì cũng gấp\ntriệu lần”2\n. \nBa là, chủ nghĩa xã hội có nền kinh tế phát triển cao dựa trên lực lượng sản xuất\nhiện đại và chế độ công hữu về tư liệu sản xuất chủ yếu\nĐây là đặc trưng về phương diện kinh tế của chủ nghĩa xã hội. Mục tiêu cao\nnhất của chủ nghĩa xã hội là giải phóng con người trên cơ sở điều kiện kinh tế - xã hội \nphát triển, mà xét đến cùng là trình độ phát triển cao của lực lượng sản xuất. Chủ nghĩa \nxã hội là xã hội có nền kinh tế phát triển cao, với lực lượng sản xuất hiện đại, quan hệ\nsản xuất dựa trên chế độ công hữu về tư liệu sản xuất, được tổ chức quản lý có hiệu\nquả, năng suất lao động cao và phân phối chủ yếu theo lao động. V.I.Lênin cho rằng: \n“từ chủ nghĩa tư bản, nhân loại chỉ có thể tiến thẳng lên chủ nghĩa xã hội, nghĩa là chế\nđộ công hữu về các tư liệu sản xuất và chế độ phân phối theo lao động của mỗi \nngười”3\n.\nTuy nhiên, trong giai đoạn đầu của xã hội cộng sản chủ nghĩa, chủ nghĩa xã hội, \ntheo Ph.Ăngghen không thể ngay lập tức thủ tiêu chế độ tư hữu. Trả lời câu hỏi: Liệu\ncó thể thủ tiêu chế độ tư hữu ngay lập tức được không? Ph.Ăngghen dứt khoát cho \nrằng: “Không, không thể được cũng y như không thể làm cho lực lượng sản xuất hiện\ncó tăng lên ngay lập tức đến mức cần thiết để xây dựng nền kinh tế công hữu. Cho nên\ncuộc cách mạng của giai cấp vô sản đang có tất cả những triệu chứng là sắp nổ ra, sẽ chỉ\ncó thể cải tạo xã hội hiện nay một cách dần dần, và chỉ khi nào đã tạo nên một khối\nlượng tư liệu cần thiết cho việc cải tạo đó là khi ấy mới thủ tiêu được chế độ tư hữu”\n4\n.\nCùng với việc từng bước xác lập chế độ công hữu về tư liệu sản xuất, để\nnâng cao năng suất lao động cần phải tổ chức lao động theo một trình độ cao hơn, tổ\nchức chặt chẽ và kỷ luật lao động nghiêm., nghĩa là phải tạo ra quan hệ sản xuất tiến \nbộ, thích ứng với trình độ phát triển của lực lượng sản xuất. V.I. Lệnin cho rằng: “thiết \nlập một chế độ xã hội cao hơn chủ nghĩa tư bản, nghĩa là nâng cao năng suất lao động\nvà do đó (và nhằm mục đích đó) phải tổ chức lao động theo một trình độ cao hơn”\n5\n. \n1\n.Mác và Ph.Ăngghen, Toàn tập, Nxb. CTQG, H.1995, tập. 4, tr.626.\n2 V.I.Lênin, Toàn tập, Nxb Tiến bộ, Mátxcơva, 1976, tập. 37, tr.312-313.\n3 V.I.Lênin, Toàn tập, Nxb. Tiến bộ, Matxcơva.1977, tập. 31, tr.220.\n4 C.Mác và Ph.Ăngghen, Toàn tập, Nxb. CTQG, H. 1995, tập 4, tr.469.\n5 V.I.Lênin, Toàn tập, Nxb Tiến bộ, Mátxcơva, 1976, tập. 36, tr.228-229.\n54\nĐối với những nước chưa trải qua chủ nghĩa tư bản di lên chủ nghĩa xã hội, để \nphát triển lực lượng sản xuất , nâng cao năng suất lao động, V.I.Lênin chỉ rõ tất yếu \nphải “bắc những chiếc cầu nhỏ vững chắc” xuyên qua chủ nghĩa tư bản nhà nước: \n“Trong một nước tiểu nông, trước hết các đồng chí phải bắc những chiếc cầu nhỏ\nvững chắc, đi xuyên qua chủ nghĩa tư bản nhà nước, tiến lên chủ nghĩa xã hội”1\n. \n“dưới chính quyền xô- viết thì chủ nghĩa tư bản nhà nước sẽ có thể là ¾ chủ nghĩa \nxã hội”2\n. Đồng thời, V.I.Lênin chỉ rõ, những nước chưa trải qua chủ nghĩa tư bản di \nlên chủ nghĩa xã hội cần thiết phải học hỏi kinh nghiệm tử các nước phát triển theo \ncách thức: “Dùng cả hai tay mà lấy những cái tốt của nước ngoài: Chính quyền xô-viết \n+ trật tự ở đường sắt Phổ + kỹ thuật và cách tổ chức các tơ-rớt ở Mỹ + ngành giáo dục \nquốc dân Mỹ etc. etc. + + = ∑ (tổng số) = chủ nghĩa xã hội”3\n.\nBốn là, chủ nghĩa xã hội có nhà nước kiểu mới mang bản chất giai cấp công \nnhân, đại biểu cho lợi ích, quyền lực và ý chí của nhân dân lao động.\nCác nhà sáng lập chủ nghĩa xã hội khoa học đã khẳng định trong chủ nghĩa xã \nhội phải thiết lập nhà nước chuyên chính vô sản, nhà nước kiểu mới mang bản chất của \ngiai cấp công nhân, đại biểu cho lợi ích, quyền lực và ý chí của nhân dân lao động.\nTheo V.I.Lênin, chuyên chính cách mạng của giai cấp vô sản là một chính \nquyền do giai cấp vô sản giành được và duy trì bằng bạo lực đối với giai cấp tư sản. \nChính quyền đó chính là nhà nước kiểu mới thực hiện dân chủ cho tuyệt đại đa số\nnhân dân và trấn áp bằng vũ lực bọn bóc lột, bọn áp bức nhân dân, thực chất của sự\nbiến đổi của chế độ dân chủ trong thời kỳ quá độ từ chủ nghĩa tư bản lên chủ nghĩa \ncộng sản\n4\n. Nhà nước vô sản, theo V.I.Lênin phải là một công cụ, một phương tiện; \nđồng thời, là một biểu hiện tập trung trình độ dân chủ của nhân dân lao động, phản ánh \ntrình độ nhân dân tham gia vào mọi công việc của nhà nước, quần chúng nhân dân \nthực sự tham gia vào từng bước của cuộc sống và đóng vai trò tích cực trong việc quản \nlý. Cũng theo V.I.Lênin, Nhà nước xô - viết sẽ tập hợp, lôi cuốn đông đảo nhân dân\ntham gia quản lý Nhà nước, quản lý xã hội, tổ chức đời sống xã hội vì con người và \ncho con người. Nhà nước chuyên chính vô sản đồng thời với việc mở rộng rất nhiều \nchế độ dân chủ - lần đầu tiên biến thành chế độ dân chủ cho người nghèo, chế độ dân \nchủ cho nhân dân chứ không phải cho bọn nhà giàu - chuyên chính vô sản còn thực hành \nmột loạt biện pháp hạn chế quyền tự do đối với bọn áp bức, bọn bóc lột, bọn tư bản.\nNăm là, chủ nghĩa xã hội có nền văn hóa phát triển cao, kế thừa và phát huy\nnhững giá trị của văn hóa dân tộc và tinh hoa văn nhân loại.\n1 V.I.Lênin, Toàn tập, Nxb Tiến bộ, Mátxcơva, 1976, tập.44, tr. 89.\n2 V.I.Lênin, Toàn tập, Nxb Tiến bộ, Mátxcơva, 1976, tập.36, tr. 313.\n3 V.I.Lênin, Toàn tập, Nxb. CTQG, H. 2005, tập. 36, tr.684.\n4 V.I. Lênin, Toàn tập, Nxb. Tiến bộ, Mátxcơva. 1978, tập. 33, tr.109.\n55\nTính ưu việt, sự ổn định và phát triển của chế độ xã hội chủ nghĩa không chỉ thể\nhiện ở lĩnh vực kinh tế, chính trị mà còn ở lĩnh vực văn hóa - tinh thần của xã hội.\nTrong chủ nghĩa xã hội, văn hóa là nền tảng tinh thần của xã hội, mục tiêu, \nđộng lực của phát triển xã hội, trọng tâm là phát triển kinh tế; văn hóa đã \nhun đúc nên tâm hồn, khí phách, bản lĩnh con người, biến con người thành con người \nchân, thiện mỹ.",
    "V.I.Lênin, trong quá trình xây dựng chủ nghĩa xã hội ở nước Nga xô - viết đã\nluận giải sâu sắc về “văn hóa vô sản” - nền văn hóa mới xã hội chủ nghĩa, rằng, chỉ\ncó xây dựng được nền văn hóa vô sản mới giải quyết được mọi vấn đề từ kinh tế, \nchính trị đến xã hội, con người. Người khẳng định: “…nếu không hiểu rõ rằng chỉ có\nsự hiểu biết chính xác về nền văn hóa được sáng tạo ra trong toàn bộ quá trình phát\ntriển của loài người và việc cải tạo nền văn hóa đó mới có thể xây dựng được nền văn\nhóa vô sản thì chúng ta không giải quyết được vấn đề”\n1\n. Đồng thời, V. I. Lênin cũng \ncho rằng, trong xã hội xã hội chủ nghĩa, những người cộng sản sẽ làm giàu tri thức\ncủa mình bằng tổng hợp các tri thức, văn hóa mà loài người đã tạo ra: “Người ta chỉ\ncó thể trở thành người cộng sản khi biết làm giàu trí óc của mình bằng sự hiểu biết tất\ncả những kho tàng tri thức mà nhân loại đã tạo ra”\n2\n. Do vậy, quá trình xây dựng nền\nvăn hóa xã hội chủ nghĩa phải biết kế thừa những giá trị văn hóa dân tộc và tinh hoa \nvăn nhân loại, đồng thời, cần chống tư tưởng, văn hóa phi vô sản, trái với những giá trị\ntruyền thống tốt đẹp của dân tộc và của loài người, trái với phương hướng đi lên chủ\nnghĩa xã hội.\nThứ sáu, chủ nghĩa xã hội bảo đảm bình đẳng, đoàn kết giữa các dân tộc và \ncó quan hệ hữu nghị, hợp tác với nhân dân các nước trên thế giới.\nVấn đề giai cấp và dân tộc, xây dựng một cộng đồng dân tộc, giai cấp bình \nđẳng, đoàn kết, hợp tác, hữu nghị với nhân dân các nước trên thế giới luôn có vị trí đặc \nbiệt quan trọng trong hoạch định và thực thi chiến lược phát triển của mỗi dân tộc và \nmỗi quốc gia. Theo quan điểm của các nhà sáng lập ra chủ nghĩa xã hội khoa học, vấn \nđề giai cấp và dân tộc có quan hệ biện chứng, bởi vậy, giải quyết vấn đề dân tộc, giai \ncấp trong chủ nghĩa xã hội có vị trí đặc biệt quan trọng và phải tuân thủ nguyên tắc: \n“xóa bỏ tình trạng người bóc lôt người thì tình trạng dân tộc này bóc lột dân tộc khác \ncũng bị xóa bỏ”\n3\n. Phát triển tư tưởng của C.Mác và Ph.Ăngghen, trong điều kiện cụ\nthể ở nước Nga, V.I.Lênin, trong Cương lĩnh về vấn đề dân tộc trong chủ nghĩa xã hội\nđã chỉ ra những nội dung có tính nguyên tắc để giải quyết vấn đề dân tộc: “Các dân tộc \nhoàn toàn bình đẳng; các dân tộc được quyền tự quyết; liên hiệp công nhân tất cả các\n1 V.I.Lênin, Toàn tập, Nxb. Tiến bộ, Mátxcơva, 1976, tập 41, tr.361.\n2 V.I.Lênin, Toàn tập, Nxb Tiến bộ, Mátxcơva, 1976, tập 41, tr.362.\n3 C.Mác và Ph.Ăngghen, Toàn tập, Nxb. CTQG, H.1995, tập 4, tr.624.\n56\ndân tộc lại. Đó là Cương lĩnh dân tộc mà chủ nghĩa Mác, kinh nghiệm toàn thế giới\nvà kinh nghiệm của nước Nga dạy cho công nhân”\n1\n. \nGiải quyết vấn đề dân tộc theo Cương lĩnh của V.I.Lênin, trong chủ nghĩa xã \nhội, cộng đồng dân tộc, giai cấp bình đẳng, đoàn kết và hợp tác trên cơ sở cơ sở chính \ntrị - pháp lý, đặc biệt là cơ sở kinh tế- xã hội và văn hóa sẽ từng bước xây dựng củng \ncố và phát triển. Đây là sự khác biệt căn bản về việc giải quyết vấn đề dân tộc theo \nquan điểm của chủ nghĩa Mác- Lênin và quan điểm của chủ nghĩa dân tộc cực đoan, \nhẹp hòi hoặc chủ nghĩa phân biệt chủng tộc. V.I.Lênin khẳng định: “… chỉ có chế độ\nxô - viết là chế độ có thể thật sự đảm bảo quyền bình đẳng giữa các dân tộc, bằng \ncách thực hiện trước hết sự đoàn kết tất cả những người vô sản, rồi đến toàn thể\nquần chúng lao động, trong việc đấu tranh chống giai cấp tư sản”2\n.\nChủ nghĩa xã hội, với bản chất tốt đẹp do con người, vì con người luôn là bảo \nđảm cho các dân tộc bình đẳng, đoàn kết và hợp tác hữu nghị; đồng thời có quan hệ\nvới nhân dân tất cả các nước trên thế giới. Tất nhiên, để xây dựng cộng đồng bình \nđẳng, đoàn kết và có quan hệ hợp tác, hữu nghị với nhân dân tất cả các nước trên thế\ngiới, điều kiện chiến thắng hoàn toàn chủ nghĩa tư bản, theo V.I.Lênin cần thiết phải có \nsự liên minh và sự thống nhất của giai cấp vô sản và toàn thể quần chúng cần lao thuộc\ntất cả các nước và các dân tộc trên toàn thế giới: “Không có sự cố gắng tự nguyện tiến\ntới sự liên minh và sự thống nhất của giai cấp vô sản, rồi sau nữa, của toàn thể quần\nchúng cần lao thuộc tất cả các nước và các dân tộc trên toàn thế giới, thì không thể chiến \nthắng hoàn toàn chủ nghĩa tư bản được”3\n. Trong “Luận cương về vấn đề dân tộc và vấn \nđề thuộc địa” văn kiện về giải quyết vấn đề dân tộc trong thời đại đế quốc chủ nghĩa và \ncách mạng vô sản, V. I. Lê-nin chỉ rõ: “Trọng tâm trong toàn bộ chính sách của Quốc \ntế Cộng sản về vấn đề dân tộc và vấn đề thuộc địa là cần phải đưa giai cấp vô sản và \nquần chúng lao động tất cả các dân tộc và các nước lại gần nhau trong cuộc đấu tranh \ncách mạng chung để lật đổ địa chủ và tư sản. Bởi vì, chỉ có sự gắn bó như thế mới bảo \nđảm cho thắng lợi đối với chủ nghĩa tư bản, không có thắng lợi đó thì không thể tiêu \ndiệt được ách áp bức dân tộc và sự bất bình đẳng”4\n. Đó cũng là cơ sở để Người đưa ra \nkhẩu hiệu: “Vô sản tất cả các nước và các dân tộc bị áp bức đoàn kết lại”. \nBảo đảm bình đẳng, đoàn kết giữa các dân tộc và có quan hệ hợp tác, hữu nghị\nvới nhân dân tất cả các nước trên thế giới, chủ nghĩa xã hội mở rộng được ảnh hưởng\nvà góp phần tích cực vào cuộc đấu tranh chung của nhân dân thế giới vì hòa bình,\nđộc lập dân tộc, dân chủ và tiến bộ xã hội.\n1 V.I.Lênin, Toàn tập, Nxb. Tiến bộ, Mátxcơva. 1976, tập. 25, tr.375.\n2 V.I.Lênin, Toàn tập, Nxb. Tiến bộ, Mátxcơva, 1976, tập. 41, tr.202.\n3 V.I.Lênin, Toàn tập, Nxb Tiến bộ, Mátxcơva, 1976, tập. 41 tr.206.\n4 Viện Mác - Lênin, V. I. Lênin và Quốc tế Cộng sản, Nxb. Sách chính trị, Mát-xcơ-va, 1970, Tiếng \nNga, tr199.\n57\n2. Thời kỳ quá độ lên chủ nghĩa xã hội\n2.1. Tính tất yếu khách quan của thời kỳ quá độ lên chủ nghĩa xã hội \nHọc thuyết hình thái kinh tế- xã hội của chủ nghĩa Mác- Lênin đã chỉ rõ: lịch sử\nxã hội đã trải qua 5 hình thái kinh tế- xã hội: Cộng sản nguyên thủy, chiếm hữu nô lệ, \nphong kiến, tư bản chủ nghĩa và cộng sản chủ nghĩa. So với các hình thái kinh tế xã \nhội đã xuất hiện trong lịch sử, hình thái kinh tế- xã hội cộng sản chủ nghĩa có sự khác \nbiệt về chất, trong đó không có giai cấp đối kháng, con người từng bước trở thành \nngười tự do…,. Bởi vậy, theo quan điểm của chủ nghĩa Mác- Lênin, từ chủ nghĩa tư \nbản lên chủ nghĩa xã hội tất yếu phải trải qua thời kỳ quá độ chính trị. C. Mác khẳng \nđịnh: “Giữa xã hội tư bản chủ nghĩa và xã hội cộng sản chủ nghĩa là một thời kỳ cải \nbiến cách mạng từ xã hội này sang xã hội kia. Thích ứng với thời kỳ ấy là một thời kỳ\nquá độ chính trị, và nhà nước của thời kỳ ấy không thể là cái gì khác hơn là nền \nchuyên chính cách mạng của giai cấp vô sản”1\n. V.I.Lênin trong điều kiện nước Nga \nxô- viết cũng khẳng định: “Về lý luận, không thể nghi ngờ gì được rằng giữa chủ\nnghĩa tư bản và chủ nghĩa cộng sản, có một thời kỳ quá độ nhất định”2\n. Khẳng định \ntính tất yếu của thời kỳ quá độ, đồng thời các nhà sáng lập chủ nghĩa xa hội khoa học \ncũng phân biệt có hai loại quá độ từ chủ nghĩa tư bản lên chủ nghĩa cộng sản: 1) Quá \nđộ trực tiếp từ chủ nghĩa tư bản lên chủ nghĩa cộng sản đối với những nước đã trải qua \nchủ nghĩa tư bản phát triển. Cho đến nay thời kỳ quá độ trực tiếp lên chủ nghĩa cộng \nsản từ chủ nghĩa tư bản phát triển chưa từng diễn ra; 2) Quá độ gián tiếp từ chủ nghĩa \ntư bản lên chủ nghĩa cộng sản đối với những nước chưa trải qua chủ nghĩa tư bản phát \ntriển. Trên thế giới một thế kỷ qua, kể cả Liên Xô và các nước Đông Âu trước đây, \nTrung Quốc, Việt Nam và một số nước xã hội chủ nghĩa khác ngày nay, theo đúng lý \nluận Mác - Lênin, đều đang trải qua thời kỳ quá độ gián tiếp với những trình độ phát \ntriển khác nhau.\nXuất phát từ quan điểm cho rằng: chủ nghĩa cộng sản không phải là một trạng \nthái cần sáng tạo ra , không phải là một lý tưởng mà hiện thực phải tuân theo mà là kết \nquả của phong trào hiện thực, các nhà sáng lập chủ nghĩa xã hội khoa học cho rằng: \nCác nước lạc hậu với sự giúp đỡ của giai cấp vô sản đã chiến thắng có thể rút ngắn \nđược quá trình phát triển: “với sự giúp đỡ của giai cấp vô sản đã chiến thắng, các dân \ntộc lạc hậu có thể rút ngắn khá nhiều quá trình phát triển của mình lên xã hội xã hội \nchủ nghĩa và tránh được phần lớn những đau khổ và phần lớn các cuộc đấu tranh mà \nchúng ta bắt buộc phải trải qua ở Tây Âu”3\n. C.Mác, khi tìm hiểu về nước Nga cũng chỉ\nrõ: “Nước Nga… có thể không cần trải qua đau khổ của chế độ (chế độ tư bản chủ nghĩa -\n1 C. Mác và Ph.Ăngghen, Toàn tập, Nxb. CTQG, H. 1983, tập 19, tr. 47.\n2 V.I.Lênin, Toàn tập, Nxb. Tiến bộ, Matxcơva. 1977, tập 39, tr. 309-310.\n3 Từ điển Chủ nghĩa cộng sản khoa học, Nxb Sự thật, Hà Nội, 1986, tr. 55.\n58\nTG) mà vẫn chiếm đoạt được mọi thành quả của chế độ ấy”1\n.\nVận dụng và phát triển quan điểm của C. Mác và Ph.Ăngghen trong điều kiện \nmới, sau cách mạng tháng Mười, V.I.Lênin khẳng định: “với sự giúp đỡ của giai cấp \nvô sản các nước tiên tiến, các nước lạc hậu có thể tiến tới chế độ xô - viết, và qua \nnhững giai đoạn phát triển nhất định, tiến tới chủ nghĩa cộng sản không phải trải qua giai \nđoạn phát triển tư bản chủ nghĩa (hiểu theo nghĩa con đường rút ngắn - TG)”2\n.\nQuán triệt và vận dụng, phát triển sáng tạo những lý của chủ nghĩa Mác- Lênin, \ntrong thời đại ngay nay, thời đại quá độ từ chủ nghĩa tư bản lên chủ nghĩa xã hội trên \nphạm vi toàn thế giới, chúng ta có thể khẳng định: Với lợi thế của thời đại, trong bối \ncảnh toàn cầu hóa và cách mạng công nghiệp 4.0, các nước lạc hậu, sau khi giành \nđược chính quyền, dưới sự lãnh đạo của Đảng Cộng sản có thể tiến thẳng lên chủ\nnghĩa xã hội chủ nghĩa bỏ qua chế độ tư bản chủ nghĩa.\n2.2. Đặc điểm thời kỳ quá độ lên chủ nghĩa xã hội\nThực chất của thời kỳ quá độ lên chủ nghĩa xã hội là thời kỳ cải biến cách mạng \ntừ xã hội tiền tư bản chủ nghĩa và tư bản chủ nghĩa sang xã hội xã hội chủ nghĩa. Xã \nhội của thời kỳ quá độ là xã hội có sự đan xen của nhiều tàn dư về mọi phương diện \nkinh tế, đạo đức, tinh thần của chủ nghĩa tư bản và những yếu tố mới mang tính chất \nxã hội chủ nghĩa của chủ nghĩa xã hội mới phát sinh chưa phải là chủ nghĩa xã hội đã\nphát triển trên cơ sở của chính nó. \nVề nội dung, thời kỳ quá độ lên chủ nghĩa xã hội là thời kỳ cải tạo cách mạng sâu sắc, triệt \nđể xã hội tư bản chủ nghĩa trên tất cả các lĩnh vực, kinh tế, chính trị, văn hóa, xã hội, xây dựng từng \nbước cơ sở vật chất- kỹ thuật và đời sống tinh thần của chủ nghĩa xã hội. Đó là thời kỳ lâu dài, gian \nkhổ bắt đầu từ khi giai cấp công nhân và nhân dân lao động giành được chính quyền đến khi xây dựng \nthành công chủ nghĩa xã hội. Có thể khái quát những đặc điểm cơ bản của thời kỳ quá độ lên chủ\nnghĩa xã hội như sau: \n- Trên lĩnh vực kinh tế\nThời kỳ quá độ từ chủ nghĩa tư bản lên chủ nghĩa xã hội, về phương diện kinh tế, \ntất yếu tồn tại nền kinh tế nhiều thành phần, trong đó có thành phần đối lập. Đề cập tới \nđặc trưng này, V.I.Lênin cho rằng: “Vậy thì danh từ quá độ có nghĩa là gì? Vận dụng \nvào kinh tế, có phải nó có nghĩa là trong chế độ hiện nay có những thành phần, những \nbộ phận, những mảnh của cả chủ nghĩa tư bản lẫn chủ nghĩa xã hội không? Bất cứ ai \ncũng thừa nhận là có. Song không phải mỗi người thừa nhận điểm ấy đều suy nghĩ xem \ncác thành phần của kết cấu kinh tế- xã hội khác nhau hiện có ở Nga, chính là như thế\nnào?. Mà tất cả then chốt của vấn đề lại chính là ở đó”3\n. Tương ứng với nước Nga, V.I \n1 C. Mác và Ph.Ăngghen, Toàn tập, Nxb. CTQG, H. 1983, tập. 22, tr. 636.\n2 V.I. Lênin, Toàn tập, Nxb. Tiến bộ, Matxcơva. 1977, tập. 41, tr. 295.\n3 V.I. Lênin, Toàn tập, Nxb. Tiến bộ, Matxcơva. 1978, tập. 36, tr. 362.\n59\nLênin cho rằng thời kỳ quá độ tồn tại 5 thành phần kinh tế: Kinh tế gia trưởng; kinh tế\nhàng hóa nhỏ; kinh tế tư bản; kinh tế tư bản nhà nước; kinh tế xã hội chủ nghĩa.\n- Trên lĩnh vực chính trị\nThời kỳ quá độ từ chủ nghĩa tư bản lên chủ nghĩa xã hội về phương diện chính \ntrị, là việc thiết lập, tăng cường chuyên chính vô sản mà thực chất của nó là việc giai \ncấp công nhân nắm và sử dụng quyền lực nhà nước trấn áp giai cấp tư sản, tiến hành \nxây dựng một xã hội không giai cấp. Đây là sự thống trị về chính trị của giai cấp công \nnhân với chức năng thực hiện dân chủ đối với nhân dân, tổ chức xây dựng và bảo vệ\nchế độ mới, chuyên chính với những phần tử thù địch, chống lại nhân dân; là tiếp tục \ncuộc đấu tranh giai cấp giữa giai cấp vô sản đã chiến thắng nhưng chưa phải đã toàn \nthắng với giai cấp tư sản đã thất bại nhưng chưa phải thất bại hoàn toàn. Cuộc đấu \ntranh diễn ra trong điều kiện mới- giai cấp công nhân đã trở thành giai cấp cầm quyền, \nvới nội dung mới- xây dựng toàn diện xã hội mới, trọng tâm là xây dựng nhà nước có \ntính kinh tế, và hình thức mới- cơ bản là hòa bình tổ chức xây dựng.\n- Trên lĩnh vực tư tưởng - văn hóa\nThời kỳ quá độ từ chủ nghĩa tư bản lên chủ nghĩa xã hội còn tồn tại nhiều tư \ntưởng khác nhau, chủ yếu là tư tưởng vô sản và tư tưởng tư sản. Giai cấp công nhân \nthông qua đội tiền phong của mình là Đảng Cộng sản từng bước xây dựng văn hóa vô \nsản, nền văn hoá mới xã hội chủ nghĩa, tiếp thu giá trị văn hóa dân tộc và tinh hoa \nvăn hóa nhân loại, bảo đảm đáp ứng nhu cầu văn hóa- tinh thần ngày càng tăng của \nnhân dân. \n- Trên lĩnh vực xã hội\nDo kết cấu của nền kinh tế nhiều thành phần qui định nên trong thời kỳ quá độ\ncòn tồn tại nhiều giai cấp, tầng lớp và sự khác biệt giữa các giai cấp tầng lớp xã hội, \ncác giai cấp, tầng lớp vừa hợp tác, vừa đấu tranh với nhau. Trong xã hội của thời kỳ\nquá độ còn tồn tại sự khác biệt giữa nông thôn, thành thị, giữa lao động trí óc và lao \nđộng chân tay. Bởi vậy, thời kỳ quá độ từ chủ nghĩa tư bản lên chủ nghĩa xã hội, về\nphương diện xã hội là thời kỳ đấu tranh giai cấp chống áp bức, bất công, xóa bỏ tệ nạn \nxã hội và những tàn dư của xã hội cũ để lại, thiết lập công bằng xã hội trên cơ sở thực \nhiện nguyên tắc phân phối theo lao động là chủ đạo. \n3. Quá độ lên chủ nghĩa xã hội ở Việt Nam\n3.1. Quá độ lên chủ nghĩa xã hội bỏ qua chế độ tư bản chủ nghĩa\nViệt Nam tiến lên chủ nghĩa xã hội trong điều kiện vừa thuận lợi vừa khó khăn \nđan xen, có những đặc trưng cơ bản:\n- Xuất phát từ một xã hội vốn là thuộc địa, nửa phong kiến, lực lượng sản xuất \nrất thấp. Đất nước trải qua chiến tranh ác liệt, kéo dài nhiều thập kỷ, hậu quả để lại còn \nnặng nề. Những tàn dư thực dân, phong kiến còn nhiều. Các thế lực thù địch thường \nxuyên tìm cách phá hoại chế độ xã hội chủ nghĩa và nền độc lập dân tộc của nhân dân ta.\n- Cuộc cách mạng khoa học và công nghệ hiện đại đang diễn ra mạnh mẽ, cuốn \nhút tất cả các nước ở mức độ khác nhau. Nền sản xuất vật chất và đời sống xã hội đang \ntrong quá trình quốc tế hoá sâu sắc, ảnh hưởng lớn tới nhịp độ phát triển lịch sử và \ncuộc sống các dân tộc. Những xu thế đó vừa tạo thời cơ phát triển nhanh cho các nước, \nvừa đặt ra những thách thức gay gắt.\n- Thời đại ngày nay vẫn là thời đại quá độ từ chủ nghĩa tư bản lên chủ nghĩa xã \nhội, cho dù chế độ xã hội chủ nghĩa ở Liên Xô và Đông Âu sụp đổ. Các nước với chế \nđộ xã hội và trình độ phát triển khác nhau cùng tồn tại, vừa hợp tác vừa đấu tranh, \ncạnh tranh gay gắt vì lợi ích quốc gia, dân tộc. Cuộc đấu tranh của nhân dân các nước \nvì hoà bình, độc lập dân tộc, dân chủ, phát triển và tiến bộ xã hội dù gặp nhiều khó \nkhăn, thách thức, song theo quy luật tiến hoá của lịch sử, loài người nhất định sẽ tiến \ntới chủ nghĩa xã hội.\nQuá độ lên chủ nghĩa xã hội bỏ qua chế độ tư bản chủ nghĩa là sự lựa chọn duy \nnhất đúng, khoa học, phản ánh đúng qui luật phát triển khách quan của cách mạng Việt \nNam trong thời đại ngày nay. Cương lĩnh năm 1930 của Đảng đã chỉ rõ: Sau khi hoàn \nthành cách mạng dân tộc, dân chủ nhân dân, sẽ tiến lên chủ nghĩa xã hội. Đây là sự lựa \nchọn dứt khoát và đúng đắn của Đảng, đáp ứng nguyện vọng thiết tha của dân tộc, \nnhân dân, phản ánh xu thế phát triển của thời đại, phù hợp với quan điểm khoa học, \ncách mạng và sáng tạo của chủ nghĩa Mác - Lênin. \nQuá độ lên chủ nghĩa xã hội bỏ qua chế độ tư bản chủ nghĩa, như Đại hội IX \ncủa Đảng Cộng sản Việt Nam xác định: Con đường đi lên của nước ta là sự phát triển \nquá độ lên chủ nghĩa xã hội bỏ qua chế độ tư bản chủ nghĩa, tức là bỏ qua việc xác lập \nvị trí thống trị của quan hệ sản xuất và kiến trúc thượng tầng tư bản chủ nghĩa, nhưng \ntiếp thu, kế thừa những thành tựu mà nhân loại đã đạt được dưới chế độ tư bản chủ \nnghĩa, đặc biệt về khoa học và công nghệ, để phát triển nhanh lực lượng sản xuất, xây \ndựng nền kinh tế hiện đại.\nĐây là tư tưởng mới, phản ánh nhận thức mới, tư duy mới của Đảng ta về con \nđường đi lên chủ nghĩa xã hội bỏ qua chế độ tư bản chủ nghĩa. Tư tưởng này cần \nđược hiểu đầy đủ với những nội dung sau đây:\nThứ nhất, quá độ lên chủ nghĩa xã hội bỏ qua chế độ tư bản chủ nghĩa là con \nđường cách mạng tất yếu khách quan, con đường xây dựng đất nước trong thời kỳ quá \nđộ lên chủ nghĩa xã hội ở nước ta.\nThứ hai, quá độ lên chủ nghĩa xã hội bỏ qua chế độ tư bản chủ nghĩa, tức là bỏ \nqua việc xác lập vị trí thống trị của quan hệ sản xuất và kiến trúc thượng tầng tư bản \nchủ nghĩa. Điều đó có nghĩa là trong thời kỳ quá độ còn nhiều hình thức sở hữu, nhiều \n60\n61\nthành phần kinh tế, song sở hữu tư nhân tư bản chủ nghĩa và thành phần kinh tế tư \nnhân tư bản tư bản chủ nghĩa không chiếm vai trò chủ đạo; thời kỳ quá độ còn nhiều \nhình thức phân phối, ngoài phân phối theo lao động vẫn là chủ đạo còn phân phối theo \nmức độ đóng góp và quĩ phúc lợi xã hội; thời kỳ quá độ vẫn còn quan hệ bóc lột và bị \nbóc lột, song quan hệ bóc lột tư bản chủ nghĩa không giữ vai trò thống trị.\nThứ ba, quá độ lên chủ nghĩa xã hội bỏ qua chế độ tư bản chủ nghĩa đòi hỏi \nphải tiếp thu, kế thừa những thành tựu mà nhân loại đã đạt được dưới chủ nghĩa tư \nbản, đặc biệt là những thành tựu về khoa học và công nghệ, thành tựu về quản lý để \nphát triển xã hội, quản lý phát triển xã hội, đặc biệt là xây dựng nền kinh tế hiện đại, \nphát triển nhanh lực lượng sản xuất.\nThứ tư, quá độ lên chủ nghĩa xã hội bỏ qua chế độ tư bản chủ nghĩa là tạo ra sự\nbiến đổi về chất của xã hội trên tất cả các lĩnh vực, là sự nghiệp rất khó khăn, phức \ntạp, lâu dài với nhiều chặng đường, nhiều hình thức tổ chức kinh tế, xã hội có tính chất \nquá độ đòi hỏi phái có quyết tâm chính trị cao và khát vọng lớn của toàn Đảng, toàn dân. \n3.2. Những đặc trưng của chủ nghĩa xã hội và phương hướng xây dựng chủ nghĩa \nxã hội ở Việt Nam hiện nay \n3.2.1.Những đặc trưng bản chất của chủ nghĩa xã hội Việt Nam \nVận dụng sáng tạo và phát triển chủ nghĩa Mác- Lênin vào điều kiện cụ thể của \nViệt Nam, tổng kết thực tiễn quá trình cách mạng Việt Nam, nhất là qua hơn 30 năm \nđổi mới, nhận thức của Đảng và nhân dân dân ta về chủ nghĩa xã hội và con đường đi \nlên chủ nghĩa xã hội ngày càng sáng rỏ. Đại hội IV (1976), nhận thức của Đảng ta về\nchủ nghĩa xã hội và con đường phát triển của cách mạng nước ta mới dừng ở mức độ\nđịnh hướng: Trên cơ sở phương hướng đúng, hãy hành động thực tế cho câu trả lời. \nĐến Đại hội VII, nhận thức của Đảng Cộng sản Việt Nam về chủ nghĩa xã hội và con \nđường đi lên chủ nghĩa đã sáng tỏ hơn, không chỉ dừng ở nhận thức định hướng, định \ntính mà từng bước đạt tới trình độ đình hình, định lượng. Cương lĩnh xây dựng đất \nnước trong thời kỳ quá độ lên chủ nghĩa xã hội (1991), đã xác định mô hình chủ nghĩa \nxã hội ở nước ta với sáu đặc trưng1\n. Đến Đại hội XI, trên cơ sở tổng kết 25 năm đổi \nmới, nhận thức của Đảng ta về chủ nghĩa xã hội và con đường đi lên chủ nghĩa xã hội \nđã có bước phát triển mới. Cương lĩnh xây dựng đất nước trong thời kỳ quá độ lên chủ\nnghĩa xã hội (bổ sung, phát triển năm 2011) đã phát triển mô hình chủ nghĩa xã hội \nViệt Nam với tám đặc trưng, trong đó có đặc trưng về mục tiêu, bản chất, nội dung \n1 1) Do nhân dân lao động làm chủ; 2) Có một nền kinh tế phát triển cao dựa trên lực lượng sản\nxuất hiện đại và chế độ công hữu về các tư liệu sản xuất chủ yếu; 3) Có nền văn hóa tiên tiến, đậm \nđà bản sắc dân tộc; 4) Con người được giải phóng khỏi áp bức, bóc lột, bất công, làm theo năng lực,\nhưởng theo lao động, có cuộc sống ấm no, tự do hạnh phúc, có điều kiện phát triển toàn diện cá nhân; \n5) Các dân tộc trong nước bình đẳng, đoàn kết và giúp đỡ lẫn nhau cùng tiến bộ; 6) Có quan hệ hữu\nnghị và hợp tác với nhân dân tất cả các nước trên thế giới”.\n62\ncủa xã hội xã hội chủ nghĩa mà nhân dân ta xây dựng, đó là:\nMột là: Dân giàu, nước mạnh, dân chủ, công bằng, văn minh.\nHai là: Do nhân dân làm chủ.\nBa là: Có nền kinh tế phát triển cao dựa trên lực lượng sản xuất hiện đại và \nquan hệ sản xuất tiến bộ phù hợp.\nBốn là: Có nền văn hóa tiên tiến, đậm đà bản sắc dân tộc.\nNăm là: Con người có cuộc sống ấm no, tự do, hạnh phúc, có điều kiện phát \ntriển toàn diện.\nSáu là: Các dân tộc trong cộng đồng Việt Nam bình đẳng, đoàn kết, tôn trọng \nvà giúp nhau cùng phát triển.\nBảy là: Có Nhà nước pháp quyền xã hội chủ nghĩa của nhân dân, do nhân dân, \nvì nhân dân do Đảng Cộng sản lãnh đạo.\nTám là: Có quan hệ hữu nghị và hợp tác với các nước trên thế giới1\n.\n3.2.2 Phương hướng xây dựng chủ nghĩa xã hội ở Việt Nam hiện nay\nTrên cơ sở xác định rõ mục tiêu, đặc trưng của chủ nghĩa xã hôi, những nhiệm \nvụ của sự nghiệp xây dựng đất nước trong thời kỳ quá độ lên chủ nghĩa xã hội, Đảng \nta, đã xác định tám phương hướng cơ bản đòi hỏi toàn Đảng, toàn quân và toàn dân ta \ncần nêu cao tinh thần cách mạng tiến công, ý chí tự lực tự cường, phát huy mọi tiềm \nnăng và trí tuệ, tận dụng thời cơ, vượt qua thách thức xây dựng đất nước ta to đẹp hơn, \nđàng hoàng hơn.\nCương lĩnh xây dựng đất nước trong thời quá độ lên chủ nghĩa xã hội (1991) xác \nđịnh 7 phương hướng cơ bản phản ánh con đường quá độ lên chủ nghĩa xã hội ở nước \nta2\n. Đại hội XI, trong Cương lĩnh xây dựng đất nước trong thời quá độ lên chủ nghĩa xã \n1 http://tulieuvankien.dangcongsan.vn/ban-chap-hanh-trung-uong-dang/dai-hoi-dang/lan-thu-xi/cuong￾linh-xay-dung-dat-nuoc-trong-thoi-ky-qua-do-len-chu-nghia-xa-hoi-bo-sung-phat-trien-nam-2011-\n1528\n2 1) xây dựng Nhà nước xã hội chủ nghĩa, Nhà nước của nhân dân, do nhân dân, vì nhân dân, lấy liên \nminh giai cấp công nhân với giai cấp nông dân và tầng lớp trí thức làm nền tảng, do đảng cộng sản \nlãnh đạo. Thực hiện đầy đủ quyền dân chủ của nhân dân, giữ nghiêm kỷ cương xã hội, chuyên chính \nvới mọi hành động xâm phạm lợi ích của Tổ quốc và của nhân dân; 2) phát triển lực lượng sản xuất, \ncông nghiệp hoá đất nước theo hướng hiện đại gắn liền với phát triển một nền nông nghiệp toàn diện \nlà nhiệm vụ trung tâm nhằm từng bước xây dựng cơ sở vật chất - kỹ thuật của chủ nghĩa xã hội, không \nngừng nâng cao năng suất lao động xã hội và cải thiện đời sống nhân dân; 3) phù hợp với sự phát triển \ncủa lực lượng sản xuất, thiết lập từng bước quan hệ sản xuất xã hội chủ nghĩa từ thấp đến cao với sự \nđa dạng về hình thức sở hữu. Phát triển nền kinh tế hàng hoá nhiều thành phần theo định hướng xã hội \nchủ nghĩa, vận hành theo cơ chế thị trường có sự quản lý của Nhà nước. Kinh tế quốc doanh và kinh tế\ntập thể ngày càng trở thành nền tảng của nền kinh tế quốc dân. Thực hiện nhiều hình thức phân phối, \nlấy phân phối theo kết quả lao động và hiệu quả kinh tế là chủ yếu;4) tiến hành cách mạng xã hội chủ \nnghĩa trên lĩnh vực tư tưởng và văn hoá làm cho thế giới quan Mác - Lênin và tư tưởng, đạo đức Hồ \nhội (Bổ sung và phát triển năm 2011) xác định 8 phương hướng, phản ánh con đường \nđi lên chủ nghĩa xã hội ở nước ta, đó là: \nMột là, đẩy mạnh công nghiệp hoá, hiện đại hoá đất nước gắn với phát triển \nkinh tế tri thức, bảo vệ tài nguyên, môi trường.\nHai là, phát triển nền kinh tế thị trường định hướng xã hội chủ nghĩa.\nBa là, xây dựng nền văn hoá tiên tiến, đậm đà bản sắc dân tộc; xây dựng con \nngười, nâng cao đời sống nhân dân, thực hiện tiến bộ và công bằng xã hội.\nBốn là, bảo đảm vững chắc quốc phòng và an ninh quốc gia, trật tự, an toàn xã hội.\nNăm là, thực hiện đường lối đối ngoại độc lập, tự chủ, hoà bình, hữu nghị, hợp \ntác và phát triển; chủ động và tích cực hội nhập quốc tế.\nSáu là, xây dựng nền dân chủ xã hội chủ nghĩa, thực hiện đại đoàn kết toàn dân \ntộc, tăng cường và mở rộng mặt trận dân tộc thống nhất.\nBảy là, xây dựng Nhà nước pháp quyền xã hội chủ nghĩa của nhân dân, do nhân \ndân, vì nhân dân.\nTám là, xây dựng Đảng trong sạch, vững mạnh.\nTrong quá trình thực hiện các phương hướng cơ bản đó, Đảng yêu cầu phải đặc \nbiệt chú trọng nắm vững và giải quyết tốt các mối quan hệ lớn: quan hệ giữa đổi mới, \nổn định và phát triển; giữa đổi mới kinh tế và đổi mới chính trị; giữa kinh tế thị trường \nvà định hướng xã hội chủ nghĩa; giữa phát triển lực lượng sản xuất và xây dựng, hoàn \nthiện từng bước quan hệ sản xuất xã hội chủ nghĩa; giữa tăng trưởng kinh tế và phát \ntriển văn hoá, thực hiện tiến bộ và công bằng xã hội; giữa xây dựng chủ nghĩa xã hội \nvà bảo vệ Tổ quốc xã hội chủ nghĩa; giữa độc lập, tự chủ và hội nhập quốc tế; giữa \nĐảng lãnh đạo, Nhà nước quản lý, nhân dân làm chủ;... Không phiến diện, cực đoan, \nduy ý chí.\nChí Minh giữ vị trí chỉ đạo trong đời sống tinh thần xã hội. Kế thừa và phát huy những truyền thống \nvăn hoá tốt đẹp của tất cả các dân tộc trong nước, tiếp thu những tinh hoa văn hoá nhân loại, xây dựng \nmột xã hội dân chủ, văn minh vì lợi ích chân chính và phẩm giá con người, với trình độ tri thức, đạo \nđức, thể lực và thẩm mỹ ngày càng cao. Chống tư tưởng, văn hoá phản tiến bộ, trái với những truyền \nthống tốt đẹp của dân tộc và những giá trị cao quý của loài người, trái với phương hướng đi lên chủ \nnghĩa xã hội; 5) thực hiện chính sách đại đoàn kết dân tộc, củng cố và mở rộng Mặt trận dân tộc thống \nnhất, tập hợp mọi lực lượng phấn đấu vì sự nghiệp dân giàu, nước mạnh. Thực hiện chính sách đối \nngoại hoà bình, hợp tác và hữu nghị với tất cả các nước; trung thành với chủ nghĩa quốc tế của giai cấp \ncông nhân, đoàn kết với các nước xã hội chủ nghĩa, với tất cả các lực lượng đấu tranh vì hoà bình, độc \nlập dân tộc, dân chủ và tiến bộ xã hội trên thế giới; 6) xây dựng chủ nghĩa xã hội và bảo vệ Tổ quốc là \nhai nhiệm vụ chiến lược của cách mạng Việt Nam. Trong khi đặt lên hàng đầu nhiệm vụ xây dựng đất \nnước, nhân dân ta luôn luôn nâng cao cảnh giác, củng cố quốc phòng, bảo vệ an ninh chính trị, trật tự \nan toàn xã hội, bảo vệ Tổ quốc và các thành quả cách mạng; 7) xây dựng Đảng trong sạch, vững \nmạnh về chính trị, tư tưởng và tổ chức ngang tầm nhiệm vụ, bảo đảm cho Đảng làm tròn trách nhiệm \nlãnh đạo sự nghiệp cách mạng xã hội chủ nghĩa ở nước ta.\n63\n64\nThực hiện tám phương hướng và giải quyết thành công những mối quan hệ lớn \nchính là đưa cách mạng nước ta theo đúng con đường phát triển quá độ lên chủ nghĩa \nxã hội bỏ qua chế độ tư bản chủ nghĩa ở nước ta. \nTổng kết 30 năm đổi mới, đất nước ta đã đạt được những thành tựu to lớn, có ý \nnghĩa lịch sử trên con đường xây dựng chủ nghĩa xã hội và bảo vệ Tổ quốc xã hội chủ\nnghĩa Đại hội XII của Đảng Cộng sản Việt Nam (2016) từ bài học kinh nghiệm của 30 \nnăm đổi mới, trong quá trình đổi mới phải chủ động, không ngừng sáng tạo trên cơ sở\nkiên định mục tiêu độc lập dân tộc và chủ nghĩa xã hội, vận dụng sáng tạo và phát triển \nchủ nghĩa Mác - Lênin, tư tưởng Hồ Chí Minh, kế thừa và phát huy truyền thống dân \ntộc, tiếp thu tinh hoa văn hóa nhân loại, vận dụng kinh nghiệm quốc tế phù hợp với \nViệt Nam, đã xác định mục tiêu từ nay đến giữa thế kỷ XXI, toàn Đảng, toàn dân ta \nphải ra sức “ Tăng cường xây dựng Đảng trong sạch, vững mạnh, nâng cao năng lực \nlãnh đạo và sức chiến đấu của Đảng, xây dựng hệ thống chính trị vững mạnh. Phát huy \nsức mạnh toàn dân tộc và dân chủ xã hội chủ nghĩa. Đẩy mạnh toàn diện, đồng bộ\ncông cuộc đổi mới; phát triển kinh tế nhanh, bền vững, phấn đấu sớm đưa nước ta cơ \nbản trở thành nước công nghiệp theo hướng hiện đại”1\n. Để thực hiện thành công các \nmục tiêu trên, toàn Đảng, toàn dân ta cần nêu cao tinh thần cách mạng tiến công, ý chí \ntự lực tự cường, phát huy mọi tiềm năng và trí tuệ, tận dụng thời cơ, vượt qua thách \nthức, quán triệt và thực hiện tốt 12 nhiệm vụ cơ bản sau đây:\n(1) Phát triển kinh tế nhanh và bền vững; tăng trưởng kinh tế cao hơn 5 năm \ntrước trên cơ sở giữ vững ổn định kinh tế vĩ mô, đổi mới mô hình tăng trưởng, cơ cấu \nlại nền kinh tế; đẩy mạnh công nghiệp hóa, hiện đại hóa, chú trọng công nghiệp hóa, \nhiện đại hóa nông nghiệp, nông thôn gắn với xây dựng nông thôn mới; phát triển kinh \ntế tri thức, nâng cao trình độ khoa học, công nghệ của các ngành, lĩnh vực; nâng cao \nnăng suất, chất lượng, hiệu quả, sức cạnh tranh của nền kinh tế; xây dựng nền kinh tế\nđộc lập, tự chủ, tham gia có hiệu quả vào mạng sản xuất và chuỗi giá trị toàn cầu.\n(2) Tiếp tục hoàn thiện thể chế, phát triển kinh tế thị trường định hướng xã hội \nchủ nghĩa; nâng cao hiệu lực, hiệu quả, kỷ luật, kỷ cương, công khai, minh bạch trong \nquản lý kinh tế, năng lực quản lý của Nhà nước và năng lực quản trị doanh nghiệp.\n(3) Đổi mới căn bản và toàn diện giáo dục, đào tạo, nâng cao chất lượng nguồn \nnhân lực; đẩy mạnh nghiên cứu, phát triển, ứng dụng khoa học, công nghệ; phát huy \nvai trò quốc sách hàng đầu của giáo dục, đào tạo và khoa học, công nghệ đối với sự\nnghiệp đổi mới và phát triển đất nước.\n1 http://tulieuvankien.dangcongsan.vn/ban-chap-hanh-trung-uong-dang/dai-hoi-dang/lan-thu-xii/bao￾cao-chinh-tri-cua-ban-chap-hanh-trung-uong-dang-khoa-xi-tai-dai-hoi-dai-bieu-toan-quoc-lan-thu-xii￾cua-dang-1600\n(4) Xây dựng nền văn hóa Việt Nam tiên tiến, đậm đà bản sắc dân tộc, con \nngười Việt Nam phát triển toàn diện đáp ứng yêu cầu phát triển bền vững đất nước và \nbảo vệ vững chắc Tổ quốc xã hội chủ nghĩa.\n(5) Quản lý tốt sự phát triển xã hội; bảo đảm an sinh xã hội, nâng cao phúc lợi \nxã hội; thực hiện tốt chính sách với người có công; nâng cao chất lượng chăm sóc sức \nkhoẻ nhân dân, chất lượng dân số, chất lượng cuộc sống của nhân dân; thực hiện tốt \nchính sách lao động, việc làm, thu nhập; xây dựng môi trường sống lành mạnh, văn \nminh, an toàn. \n(6) Khai thác, sử dụng và quản lý hiệu quả tài nguyên thiên nhiên; bảo vệ môi \ntrường; chủ động phòng, chống thiên tai, ứng phó với biến đổi khí hậu.\n(7) Kiên quyết, kiên trì đấu tranh bảo vệ vững chắc độc lập, chủ quyền, thống \nnhất, toàn vẹn lãnh thổ của Tổ quốc, bảo vệ Đảng, Nhà nước, nhân dân và chế độ xã \nhội chủ nghĩa; giữ vững an ninh chính trị, trật tự, an toàn xã hội. Củng cố, tăng cường \nquốc phòng, an ninh. Xây dựng nền quốc phòng toàn dân, nền an ninh nhân dân vững \nchắc; xây dựng lực lượng vũ trang nhân dân cách mạng, chính quy, tinh nhuệ, từng \nbước hiện đại, ưu tiên hiện đại hóa một số quân chủng, binh chủng, lực lượng.\n(8) Thực hiện đường lối đối ngoại độc lập, tự chủ, đa phương hóa, đa dạng hóa, \nchủ động và tích cực hội nhập quốc tế; giữ vững môi trường hòa bình, ổn định, tạo \nđiều kiện thuận lợi cho sự nghiệp xây dựng và bảo vệ Tổ quốc; nâng cao vị thế, uy tín \ncủa Việt Nam trong khu vực và trên thế giới.\n(9) Hoàn thiện, phát huy dân chủ xã hội chủ nghĩa và quyền làm chủ của nhân \ndân; không ngừng củng cố, phát huy sức mạnh của khối đại đoàn kết toàn dân tộc; \ntăng cường sự đồng thuận xã hội; tiếp tục đổi mới nội dung và phương thức hoạt động \ncủa Mặt trận Tổ quốc và các đoàn thể nhân dân.\n(10) Tiếp tục hoàn thiện Nhà nước pháp quyền xã hội chủ nghĩa, xây dựng bộ\nmáy nhà nước tinh gọn, trong sạch, vững mạnh; hoàn thiện hệ thống pháp luật, đẩy \nmạnh cải cách hành chính, cải cách tư pháp, xây dựng đội ngũ cán bộ, công chức, viên \nchức có phẩm chất, năng lực đáp ứng yêu cầu, nhiệm vụ; phát huy dân chủ, tăng \ncường trách nhiệm, kỷ luật, kỷ cương; đẩy mạnh đấu tranh phòng, chống tham nhũng, \nlãng phí, quan liêu, tệ nạn xã hội và tội phạm.\n(11) Xây dựng Đảng trong sạch, vững mạnh, nâng cao năng lực lãnh đạo, tăng \ncường bản chất giai cấp công nhân và tính tiên phong, sức chiến đấu, phát huy truyền \nthống đoàn kết, thống nhất của Đảng; ngăn chặn, đẩy lùi tình trạng suy thoái về tư \ntưởng chính trị, đạo đức, lối sống, những biểu hiện \"tự diễn biến\", \"tự chuyển hóa\" \ntrong nội bộ. Đổi mới mạnh mẽ công tác cán bộ, coi trọng công tác bảo vệ Đảng, bảo \nvệ chính trị nội bộ; tăng cường và nâng cao chất lượng công tác tư tưởng, lý luận, công \n65\ntác kiểm tra, giám sát và công tác dân vận của Đảng; tiếp tục đổi mới phương thức \nlãnh đạo của Đảng.\n(12) Tiếp tục quán triệt và xử lý tốt các quan hệ lớn: quan hệ giữa đổi mới, ổn \nđịnh và phát triển; giữa đổi mới kinh tế và đổi mới chính trị; giữa tuân theo các quy \nluật thị trường và bảo đảm định hướng xã hội chủ nghĩa; giữa phát triển lực lượng sản \nxuất và xây dựng, hoàn thiện từng bước quan hệ sản xuất xã hội chủ nghĩa; giữa Nhà \nnước và thị trường; giữa tăng trưởng kinh tế và phát triển văn hóa, thực hiện tiến bộ và \ncông bằng xã hội; giữa xây dựng chủ nghĩa xã hội và bảo vệ Tổ quốc xã hội chủ nghĩa; \ngiữa độc lập, tự chủ và hội nhập quốc tế; giữa Đảng lãnh đạo, Nhà nước quản lý, nhân \ndân làm chủ;...\nĐại hội XII cũng xác định 9 mối quan hệ lớn cần nhận thức và giải quyết: Quan \nhệ giữa đổi mới, ổn định và phát triển; giữa đổi mới kinh tế và đổi mới chính trị; giữa \ntuân theo các quy luật thị trường và bảo đảm định hướng xã hội chủ nghĩa; giữa phát \ntriển lực lượng sản xuất và xây dựng, hoàn thiện từng bước quan hệ sản xuất xã hội \nchủ nghĩa; giữa Nhà nước và thị trường; giữa tăng trưởng kinh tế và phát triển văn \nhóa, thực hiện tiến bộ và công bằng xã hội; giữa xây dựng chủ nghĩa xã hội và bảo vệ\nTổ quốc xã hội chủ nghĩa; giữa độc lập, tự chủ và hội nhập quốc tế; giữa Đảng lãnh \nđạo, Nhà nước quản lý, nhân dân làm chủ.\nC. CÂU HỎI ÔN TẬP\n1. Phân tích điều kiện ra đời và những đặc trưng của chủ nghĩa xã hội? Liên hệ\nvới thực tiễn Việt Nam?\n2. Phân tích tính tất yếu, đặc điểm của thời kỳ quá độ lên chủ nghĩa xã hội? \nLiên hệ Việt Nam?\n3. Phân tích luận điểm của Đảng Cộng sản Việt Nam về con đường đi lên của \nnước ta là sự phát triển quá độ lên chủ nghĩa xã hội bỏ qua chế độ tư bản chủ nghĩa? \nDANH MỤC TÀI LIỆU THAM KHẢO\n1. Đảng Cộng sản Việt Nam, Cương lĩnh xây dựng đất nước trong thời kỳ quá \nđộ lên chủ nghĩa xã hội. Nhà xuất bản Sự Thật, Hà Nội, 1991.\n2. Đảng Cộng sản Việt Nam, Cương lĩnh xây dựng đất nước trong thời kỳ quá \nđộ lên chủ nghĩa xã hội (Bổ sung và phát triển năm 2011,Nhà xuất bản Sự Thật, Hà \nNội 2011.\n3. Hội đồng trung ương chỉ đạo biên soạn giáo trình quốc gia các bộ môn Mác -\nLênin, Tư tưởng Hồ Chí Minh, Giáo trình chủ nghĩa xã hội. Nhà xuất bản Chính trị\nQuốc gia, Hà Nội, 2002.\n66\n4. GS.TS Phùng Hữu Phú, GS, TS Lê Hữu Nghĩa, GS.TS Vũ Văn Hiền, \nPGS.TS Nguyễn Viết Thông… (đồng chủ biên), Một số vấn đề lý luận - thực tiễn về\nchủ nghĩa xã hội và con đường đi lên chủ nghĩa xã hội ở Việt Nam qua 30 năm đổi \nmới. Nhà xuất bản Chính trị Quốc gia, Hà Nội, 2016.\n5. Học viện Chính trị quốc gia Hồ Chí Minh, Giáo trình Chủ nghĩa xã hội khoa \nhọc, dành cho hệ cao cấp lý luận chính trị, H.2018.\n67"
  ],
  "metadatas": [
    {
      "source": "Giáo trình Chủ nghĩa xã hội khoa học (K-2021)",
      "document": "Chương III: Chủ nghĩa xã hội và thời kỳ quá độ lên chủ nghĩa xã hội",
      "topic": "chủ nghĩa xã hội",
      "page": "chunk_1",
      "credibility_score": 100,
      "source_type": "textbook",
      "text": "Chương 3\nCHỦ NGHĨA XÃ HỘI VÀ\nTHỜI KỲ QUÁ ĐỘ LÊN CHỦ NGHĨA XÃ HỘI\nA. MỤC TIÊU\n1. Về kiến thức: Sinh viên nắm được những quan điểm của chủ nghĩa Mác -\nLênin về chủ nghĩa xã hội, thời kỳ quá độ lên chủ nghĩa xã hội và sự vận dụng sáng \ntạo của Đảng Cộng sản Việt Nam vào điều kiện cụ thể Việt Nam.\n2. Về kỹ năng: Sinh viên bước đầu biết vận dụng những tri thức có được vào \nphân tích những vấn đề cơ bản về chủ nghĩa xã hội và con đường đi lên chủ nghĩa xã \nhội ở Việt Nam hiện nay.\n3. Về tư tưởng: sinh viên khẳng định niềm tin vào chế độ xã hội chủ nghĩa, luôn \ntin và ủng hộ đường lối đổi mới theo định hướng xã hội chủ nghĩa dưới sự lãnh đạo \ncủa Đảng Cộng sản Việt Nam. \nB. NỘI DUNG\n1. Chủ nghĩa xã hội \nChủ nghĩa xã hội (tiếng Anh: Socialism) được hiểu theo bốn nghĩa:1) Là phong \ntrào thực tiễn, phong trào đấu tranh của nhân dân lao động chống lại áp bức, bất công, \nchống các giai cấp thống trị; 2) Là trào lưu tư tưởng, lý luận phản ánh lý tưởng giải \nphóng nhân dân lao động khỏi áp bức, bóc lột, bất công; 3) Là một khoa học - Chủ\nnghĩa xã hội khoa học, khoa học về sứ mệnh lịch sử của giai cấp công nhân; 4) Là một \nchế độ xã hội tốt đẹp, giai đoạn đầu của hình thái kinh tế- xã hội cộng sản chủ nghĩa.\n1.1. Chủ nghĩa xã hội, giai đoạn đầu của hình thái kinh tế - xã hội cộng sản chủ nghĩa \nCác nhà sáng lập chủ nghĩa xã hội khoa học, C.Mác Ph.Ăngghen khi nghiên \ncứu lịch sử phát triển của xã hội loài người, nhất là lịch sử xã hội tư bản đã xây dựng \nnên học thuyết về hình thái kinh tế- xã hội. Học thuyết vạch rõ những qui luật cơ bản \ncủa vận động xã hội, chỉ ra phương pháp khoa học để giải thích lịch sử. Học thuyết hình \nthái kinh tế- xã hội của C. Mác không chỉ làm rõ những yếu tố cấu thành hình thái kinh \ntế- xã hội mà còn xem xét xã hội trong quá trình biến đổi và phát triển không ngừng.\nHọc thuyết về hình thái kinh tế - xã hội do C.Mác và Ph.Ăngghen khởi xướng \nđược V.I.Lênin bổ sung, phát triển và hiện thực hoá trong công cuộc xây dựng chủ\nnghĩa xã hội ở nước Nga Xô viết trở thành học thuyết hình thái kinh tế - xã hội của chủ\nnghĩa Mác- Lênin, tài sản vô giá của nhân loại. \nHọc thuyết hình thái kinh tế - xã hội của chủ nghĩa Mác - Lênin đã chỉ ra tính \ntất yếu sự thay thế hình thái kinh tế- xã hội tư bản chủ nghĩa bằng hình thái kinh tế - xã \n48\n49\nhội cộng sản chủ nghĩa, đó là quá trình lịch sử - tự nhiên. Sự thay thế này được thực \nhiện thông qua cách mạng xã hội chủ nghĩa xuất phát từ hai tiền đề vật chất quan trọng \nnhất là sự phát triển của lực lượng sản xuất và sự trưởng thành của giai cấp công nhân. \nHọc thuyết hình thái kinh tế - xã hội của chủ nghĩa Mác - Lênin đã cung cấp \nnhững tiêu chuẩn thực sự duy vật, khoa học cho sự phân kỳ lịch sử, trong đó có sự\nphân kỳ hình thái kinh tế - xã hội cộng sản chủ nghĩa. \nKhi phân tích hình thái kinh tế - xã hội cộng sản chủ nghĩa, C.Mác và \nPh.Ăngghen cho rằng, hình thái kinh tế - xã hội cộng sản chủ nghĩa phát triển từ thấp \nlên cao qua hai giai đoạn, giai đoạn thấp và giai đoạn cao, giai đoạn cộng sản chủ\nnghĩa; giữa xã hội tư bản chủ nghĩa và xã hội cộng sản chủ nghĩa là thời kỳ quá độ lên \nchủ nghĩa cộng sản. Trong tác phẩm “Phê phán cương lĩnh Gôta” (1875) C.Mác đã cho \nrằng: “Giữa xã hội tư bản chủ nghĩa và xã hội cộng sản chủ nghĩa là một thời kỳ cải \nbiến cách mạng từ xã hội này sang xã hội kia. Thích ứng với thời kỳ ấy là một thời kỳ\nquá độ chính trị, và nhà nước của thời kỳ ấy không thể là cái gì khác hơn là nền \nchuyên chính cách mạng của giai cấp vô sản”1\n. Khẳng định quan điểm của C. Mác,"
    },
    {
      "source": "Giáo trình Chủ nghĩa xã hội khoa học (K-2021)",
      "document": "Chương III: Chủ nghĩa xã hội và thời kỳ quá độ lên chủ nghĩa xã hội",
      "topic": "chủ nghĩa xã hội",
      "page": "chunk_2",
      "credibility_score": 100,
      "source_type": "textbook",
      "text": "V.I. Lênin cho rằng: “Về lý luận, không thể nghi ngờ gì được rằng giữa chủ nghĩa tư \nbản và chủ nghĩa cộng sản, có một thời kỳ quá độ nhất định”2\n. \nVề xã hội của thời kỳ quá độ, C. Mác cho rằng đó là xã hội vừa thoát thai từ xã \nhội tư bản chủ nghĩa, xã hội chưa phát triển trên cơ sở của chính nó còn mang nhiều \ndấu vết của xã hội cũ để lại: “Cái xã hội mà chúng ta nói ở đây không phải là một xã \nhội cộng sản chủ nghĩa đã phát triển trên cơ sở của chính nó, mà trái lại là một xã hội \ncộng sản chủ nghĩa vừa thoát thai từ xã hội tư bản chủ nghĩa, do đó là một xã hội về mọi \nphương diện - kinh tế, đạo đức, tinh thần - còn mang những dấu vết của xã hội cũ mà nó \nđã lọt lòng ra”3\n. \nSau này, từ thực tiễn nước Nga, V. I Lênin cho rằng, đối với những nước chưa \ncó chủ nghĩa tư bản phát triển cao “cần phải có thời kỳ quá độ khá lâu dài từ chủ nghĩa \ntư bản lên chủ nghĩa xã hội”4\n. \nVậy là, về mặt lý luận và thực tiễn, thời kỳ quá độ từ chủ nghĩa tư bản lên chủ\nnghĩa cộng sản, được hiểu theo hai nghĩa: thứ nhất, đối với các nước chưa trải qua chủ\nnghĩa tư bản phát triển, cần thiết phải có thời kỳ quá độ khá lâu dài từ chủ nghĩa tư bản \nlên chủ nghĩa xã hội- những cơn đau đẻ kéo dài5\n; thứ hai, đối với những nước đã trải \nqua chủ nghĩa tư bản phát triển, giữa chủ nghĩa tư bản và chủ nghĩa cộng sản có một \nthời kỳ quá độ nhất định, thời kỳ cải biến cách mạng từ xã hội này sang xã hội kia, \n1 C.Mác và Ph.Ăngghen, Toàn tập, Nxb. CTQG, H. 1995, tập 19, tr.47.\n2 V.I.Lênin, Toàn tập, Nxb. Tiến bộ, Matxcơva. 1977, tập. 39, tr. 309-310.\n3 C.Mác và Ph.Ăngghen, Toàn tập, Nxb. CTQG, H. 1995, tập 19, tr.33 .\n4 V.I Lênin , Sdd, 1977, t 38, tr 464.\n5 Xem : V. I.Lênin, Sdd, 1976, tập 33, tr223.\n50\nthời kỳ quá độ từ chủ nghĩa tư bản lên chủ nghĩa cộng sản. \n1.2. Điều kiện ra đời chủ nghĩa xã hội \nBằng lý luận hình thái kinh tế - xã hội, C.Mác đã đi sâu phân tích, tìm ra qui \nluật vận động của hình thái kinh tế - xã hội tư bản chủ nghĩa, từ đó cho phép ông dự\nbáo khoa học về sự ra đời và tương lai của hình thái kinh tế - xã hội cộng sản chủ\nnghĩa. V.I Lênin cho rằng: C.Mác xuất phát từ chỗ là chủ nghĩa cộng sản hình thành từ\nchủ nghĩa tư bản, phát triển lên từ chủ nghĩa tư bản là kết quả tác động của một lực \nlượng xã hội do chủ nghĩa tư bản sinh ra - giai cấp vô sản, giai cấp công nhân hiện đại.\nCác nhà sáng lập chủ nghĩa xã hội khoa học đã thừa nhận vai trò to lớn của chủ\nnghĩa tư bản khi khẳng định: sự ra đời của chủ nghĩa tư bản là một giai đoạn mới trong \nlịch sử phát triển mới của nhân loại. Nhờ những bước tiến to lớn của lực lượng sản \nxuất, biểu hiện tập trung nhất là sự ra đời của công nghiệp cơ khí (Cách mạng công \nnghiệp lần thứ 2), chủ nghĩa tư bản đã tạo ra bước phát triển vượt bậc của lực lượng \nsản xuất. Trong vòng chưa đầy một thế kỷ, chủ nghĩa tư bản đã tạo ra được một lực \nlượng sản xuất nhiều hơn và đồ sộ hơn lực lượng sản xuất mà nhân loại tạo ra đến lúc\nđó1\n. Tuy nhiên, các ông cũng chỉ ra rằng, trong xã hội tư bản chủ nghĩa, lực lượng sản \nxuất càng được cơ khi hóa, hiện đại hóa càng mang tính xã hội hóa cao, thì càng mâu \nthuẫn với quan hệ sản xuất tư bản chủ nghĩa dựa trên chế độ chiếm hữu tư nhân tư bản\nchủ nghĩa. Quan hệ sản xuất từ chỗ đóng vai trò mở đường cho lực lượng sản xuất phát \ntriển, thì ngày càng trở nên lỗi thời, xiềng xích của lực lượng sản xuất. Mâu thuẫn giữa \ntính chất xã hội hóa của lực lượng sản xuất với chế độ chiếm hữu tư nhân tư bản chủ\nnghĩa đối với tư liệu sản xuất trở thành mâu thuẫn kinh tế cơ bản của chủ nghĩa tư bản, \nbiểu hiện về mặt xã hội là mâu thuẫn giữa giai cấp công nhân hiện đại với giai cấp tư \nsản lỗi thời. Cuộc đấu tranh giữa giai cấp công nhân và giai cấp tư sản xuất hiện ngay \ntừ đầu và ngày càng trở nên gay gắt và có tính chính trị rõ rét. C. Mác và Ph. Angghen \nchỉ rõ: “Từ chỗ là những hình thức phát triển của các lực lượng sản xuất, những quan \nhệ sản xuất ấy trở thành những xiềng xích của các lực lượng sản xuất. Khi đó bắt đầu \nthời đại môt cuộc cách mạng”2\n.\nHơn nữa, cùng với sự phát triển mạnh mẽ của nền đại công nghiệp cơ khí là sự\ntrưởng thành vượt bậc cả về số lượng và chất lượng của giai cấp công nhân, con để của \nnền đại công nghiệp. Chính sự phát triển về lực lượng sản xuất và sự trưởng thành của \ngiai cấp công nhân là tiền đề kinh tế- xã hội dẫn tới sự sụp đổ không tránh khỏi của \nchủ nghĩa tư bản. Diễn đạt tư tưởng đó, C.Mác và Ph.Ăngghen cho rằng, giai cấp tư \nsản không chỉ tạo vũ khí để giết mình mà còn tạo ra những người sử dụng vũ khí đó, \nnhững công nhân hiện đại, những người vô sản\n3\n. Sự trưởng thành vượt bậc và thực sự\n1 C.Mác và Ph.Ăngghen, Toàn tập, Nxb. CTQG, H. 1995, tập 4, tr.603.\n2 C.Mác và Ph.Ăngghen, Toàn tập, Nxb. CTQG, H. 1995, tập 3, tr.15.\n3 C.Mác và Ph.Ăngghen, Toàn tập, Nxb. CTQG, H. 1995, tập 4, tr.605.\ncủa giai cấp công nhân được đánh dấu bằng sự ra đời của Đảng cộng sản, đội tiền \nphong của giai cấp công nhân, trực tiếp lãnh đạo cuộc đấu tranh chính trị của giai cấp \ncông nhân chống giai cấp tư sản.\nSự phát triển của lực lượng sản xuất và sự trưởng thành thực sự của giai cấp \ncông nhân là tiền đề, điều kiện cho sự ra đời của hình thái kinh tế- xã hội cộng sản chủ\nnghĩa. Tuy nhiên, do khác về bản chất với tất cả các hình thái kinh tế - xã hội trước đó, \nnên hình thái kinh tế - xã hội cộng sản chủ nghĩa không tự nhiên ra đời, trái lại, nó chỉ\nđược hình thành thông qua cách mạng vô sản dưới sự lãnh đạo của đảng của giai cấp \ncông nhân - Đảng Cộng sản, thực hiện bước quá độ từ chủ nghĩa tư bản lên chủ nghĩa \nxã hội và chủ nghĩa cộng sản. \nCách mạng vô sản là cuộc cách mạng của giai cấp công nhân và nhân dân lao \nđộng dưới sự lãnh đạo của Đảng Cộng sản, trên thực tế được thực hiện bằng con \nđường bạo lực cách mạng nhằm lật đổ chế độ tư bản chủ nghĩa, thiết lập nhà nước \nchuyên chính vô sản, thực hiện sự nghiệp cải tạo xã hội cũ, xây dựng xã hội mới, xã \nhội xã hội chủ nghĩa và cộng sản chủ nghĩa. Tuy nhiên, cách mạng vô sản, về mặt lý \nthuyết cũng có thể được tiến hành bằng con đường hòa bình, nhưng vô cùng hiếm, quí \nvà trên thực tế chưa xảy ra.\nDo tính sâu sắc và triệt để của nó, cách mạng vô sản chỉ có thể thành công, hình \nthái kinh tế- xã hội cộng sản chủ nghĩa chỉ có thể được thiết lập và phát triển trên cơ sở\ncủa chính nó, một khi tính tích cực chính trị của giai cấp công nhân được khơi dậy và \nphát huy trong liên minh với các giai cấp và tầng lớp những người lao động dưới sự\nlãnh đạo của Đảng Cộng sản. \n1.3. Những đặc trưng cơ bản của chủ nghĩa xã hội \nKhi nghiên cứu về hình thái kinh tế - xã hội cộng sản chủ nghĩa, các nhà sáng \nlập chủ nghĩa xã hội khoa học rất quan tâm dự báo những đặc trưng của từng giai \nđoạn, đặc biệt là giai đoạn đầu (giai đoạn thấp) của xã hội cộng sản nhằm định \nhướng phát triển cho phong trào công nhân quốc tế. Những đặc trưng cơ bản của \ngiai đoạn đầu, phản ánh bản chất và tính ưu việt của chủ nghĩa xã hội từng bước \nđược bộc lộ đầy đủ cùng với quá trình xây dựng xã hội xã hội chủ nghĩa. Căn cứ vào\nnhững dự báo của C.Mác và Ph.Ăngghen và những quan điểm của V.I.Lênin về chủ\nnghĩa xã hội ở nước Nga xô - viết, có thể khái quát những đặc trưng cơ bản của chủ\nnghĩa xã hội như sau:\nMột là, chủ nghĩa xã hội giải phóng giai cấp, giải phóng dân tộc, giải phóng xã\nhội, giải phóng con người, tạo điều kiện để con người phát triển toàn diện.\nTrong tác phẩm Tuyên ngôn của Đảng Cộng sản, khi dự báo về xã hội tương lai, \nxã hội cộng sản chủ nghĩa, C.Mác và Ph.Ăngghen đã khẳng định: “Thay cho xã hội tư \nbản cũ, với những giai cấp và đối kháng giai cấp của nó, sẽ xuất hiện một liên hợp, trong\n51\n52\nđó sự phát triển tự do của mỗi người là điều kiện phát triển tự do của tất cả mọi người”\n1\n; \nkhi đó “con người, cuối cùng làm chủ tồn tại xã hội của chính mình, thì cũng do đó \nlàm chủ tự nhiên, làm chủ cả bản thân mình trở thành người tự do”2.\n. Đây là sự khác \nbiệt về chất giữa hình thái kinh tế - xã hội cộng sản chủ nghĩa so với các hình thái kinh\ntế - xã hội ra đời trước, thể hiện ở bản chất nhân văn, nhân đạo, vì sự nghiệp giải phóng\ngiai cấp, giải phóng xã hội, giải phóng con người. Đương nhiên, để đạt được mục tiêu \ntổng quát đó, C.Mác và Ph.Ăngghen cho rằng, cách mạng xã hội chủ nghĩa phải tiến \nhành triệt để, trước hết là giải phóng giai cấp, xóa bỏ tình trạng giai cấp này bóc lột, áp \nbức giai cấp kia, và một khi tình trạng người áp bức, bọc lột người bị xóa bỏ thì tình \ntrạng dân tộc này đi bóc lột dân tộc khác cũng bị xóa bỏ”\n3\n."
    },
    {
      "source": "Giáo trình Chủ nghĩa xã hội khoa học (K-2021)",
      "document": "Chương III: Chủ nghĩa xã hội và thời kỳ quá độ lên chủ nghĩa xã hội",
      "topic": "chủ nghĩa xã hội",
      "page": "chunk_3",
      "credibility_score": 100,
      "source_type": "textbook",
      "text": "V.I.Lênin, trong điều kiện mới của đời sống chính trị - xã hội thế giới đầu thế\nkỷ XX, đồng thời từ thực tiễn của công cuộc xây dựng chủ nghĩa xã hội ở nước Nga xô \n- viết đã cho rằng, mục đích cao nhất, cuối cùng của những cải tạo xã hội chủ nghĩa là \nthực hiện nguyên tắc: làm theo năng lực, hưởng theo nhu cầu: “khi bắt đầu những cải\ntạo xã hội chủ nghĩa, chúng ta phải đặt rõ cái mục đích mà những cải tạo xã hội chủ\nnghĩa đó rút cục nhằm tới, cụ thể là thiết lập một xã hội cộng sản chủ nghĩa, một xã hội\nkhông chỉ hạn chế ở việc tước đoạt các công xưởng, nhà máy, ruộng đất và tư liệu\nsản xuất, không chỉ hạn chế ở việc kiểm kê, kiểm soát một cách chặt chẽ việc sản xuất\nvà phân phối sản phẩm, mà còn đi xa hơn nữa, đi tới việc thực hiện nguyên tắc: làm\ntheo năng lực, hưởng theo nhu cầu. Vì thế cái tên gọi “Đảng Cộng sản là duy nhất \nchính xác về mặt khoa học”\n4 V.I.Lênin cũng khẳng định mục đích cao cả của chủ nghĩa\nxã hội cần đạt đến là xóa bỏ sự phân chia xã hội thành giai cấp, biến tất cả thành viên\ntrong xã hội thành người lao động, tiêu diệt cơ sở của mọi tình trạng người bóc lột\nngười. V.I.Lênin còn chỉ rõ trong quá trình phấn đấu để đạt mục đích cao cả đó, giai\ncấp công nhân, chính Đảng Cộng sản phải hoàn thành nhiều nhiệm vụ của các giai\nđoạn khác nhau, trong đó có mục đích, nhiệm vụ cụ thể của thời kỳ xây dựng chủ nghĩa \nxã hội - tạo ra các điều kiện về cơ sở vật chất - kỹ thuật và đời sống tinh thần để thiết lập \nxã hội cộng sản. \nHai là, chủ nghĩa xã hội là xã hội do nhân dân lao động làm chủ\nĐây là đặc trưng thể hiện thuộc tính bản chất của chủ nghĩa xã hội, xã hội vì\ncon người và do con người; nhân dân mà nòng cốt là nhân dân lao động là chủ thể của \nxã hội thực hiện quyền làm chủ ngày càng rộng rãi và đầy đủ trong quá trình cải tạo xã \nhội cũ, xây dựng xã hội mới. Chủ nghĩa xã hội là một chế độ chính trị dân chủ, nhà\nnước xã hội chủ nghĩa với hệ thống pháp luật và hệ thống tổ chức ngày càng ngày\n1 C. Mác và Ph.Ăngghen, Toàn tập, Nxb. CTQG, H.1995, tập. 4, tr.628.\n2 C.Mác và Ph.Ăngghen, Toàn tập, Nxb. CTQG, H. 1995, tập. 4, tr.33.\n3 C.Mác và Ph.Ăngghen, Toàn tập, Nxb. CTQG, H. 1995, tập.4, tr.624.\n4 V.I.Lênin, Toàn tập, Nxb Tiến bộ, Mátxcơva, 1976, tập 36, tr.57.\n53\ncàng hoàn thiện sẽ quản lý xã hội ngày càng hiệu quả. C.Mác và Ph.Ăngghen đã\nchỉ rõ: “… bước thứ nhất trong cách mạng công nhân là giai cấp vô sản biến thành\ngiai cấp thống trị là giành lấy dân chủ”\n1\n. V.I.Lênin, từ thực tiễn xây dựng chủ nghĩa\nxã hội ở nước Nga Xô viết đã coi chính quyền Xô viết là một kiểu Nhà nước chuyên\nchính vô sản, một chế độ dân chủ ưu việt gấp triệu lần so với chế độ dân chủ tư sản: \n“Chế độ dân chủ vô sản so với bất kỳ chế độ dân chủ tư sản nào cũng dân chủ hơn gấp\ntriệu lần; chính quyền Xô viết so với nước cộng hoà dân chủ nhất thì cũng gấp\ntriệu lần”2\n. \nBa là, chủ nghĩa xã hội có nền kinh tế phát triển cao dựa trên lực lượng sản xuất\nhiện đại và chế độ công hữu về tư liệu sản xuất chủ yếu\nĐây là đặc trưng về phương diện kinh tế của chủ nghĩa xã hội. Mục tiêu cao\nnhất của chủ nghĩa xã hội là giải phóng con người trên cơ sở điều kiện kinh tế - xã hội \nphát triển, mà xét đến cùng là trình độ phát triển cao của lực lượng sản xuất. Chủ nghĩa \nxã hội là xã hội có nền kinh tế phát triển cao, với lực lượng sản xuất hiện đại, quan hệ\nsản xuất dựa trên chế độ công hữu về tư liệu sản xuất, được tổ chức quản lý có hiệu\nquả, năng suất lao động cao và phân phối chủ yếu theo lao động. V.I.Lênin cho rằng: \n“từ chủ nghĩa tư bản, nhân loại chỉ có thể tiến thẳng lên chủ nghĩa xã hội, nghĩa là chế\nđộ công hữu về các tư liệu sản xuất và chế độ phân phối theo lao động của mỗi \nngười”3\n.\nTuy nhiên, trong giai đoạn đầu của xã hội cộng sản chủ nghĩa, chủ nghĩa xã hội, \ntheo Ph.Ăngghen không thể ngay lập tức thủ tiêu chế độ tư hữu. Trả lời câu hỏi: Liệu\ncó thể thủ tiêu chế độ tư hữu ngay lập tức được không? Ph.Ăngghen dứt khoát cho \nrằng: “Không, không thể được cũng y như không thể làm cho lực lượng sản xuất hiện\ncó tăng lên ngay lập tức đến mức cần thiết để xây dựng nền kinh tế công hữu. Cho nên\ncuộc cách mạng của giai cấp vô sản đang có tất cả những triệu chứng là sắp nổ ra, sẽ chỉ\ncó thể cải tạo xã hội hiện nay một cách dần dần, và chỉ khi nào đã tạo nên một khối\nlượng tư liệu cần thiết cho việc cải tạo đó là khi ấy mới thủ tiêu được chế độ tư hữu”\n4\n.\nCùng với việc từng bước xác lập chế độ công hữu về tư liệu sản xuất, để\nnâng cao năng suất lao động cần phải tổ chức lao động theo một trình độ cao hơn, tổ\nchức chặt chẽ và kỷ luật lao động nghiêm., nghĩa là phải tạo ra quan hệ sản xuất tiến \nbộ, thích ứng với trình độ phát triển của lực lượng sản xuất. V.I. Lệnin cho rằng: “thiết \nlập một chế độ xã hội cao hơn chủ nghĩa tư bản, nghĩa là nâng cao năng suất lao động\nvà do đó (và nhằm mục đích đó) phải tổ chức lao động theo một trình độ cao hơn”\n5\n. \n1\n.Mác và Ph.Ăngghen, Toàn tập, Nxb. CTQG, H.1995, tập. 4, tr.626.\n2 V.I.Lênin, Toàn tập, Nxb Tiến bộ, Mátxcơva, 1976, tập. 37, tr.312-313.\n3 V.I.Lênin, Toàn tập, Nxb. Tiến bộ, Matxcơva.1977, tập. 31, tr.220.\n4 C.Mác và Ph.Ăngghen, Toàn tập, Nxb. CTQG, H. 1995, tập 4, tr.469.\n5 V.I.Lênin, Toàn tập, Nxb Tiến bộ, Mátxcơva, 1976, tập. 36, tr.228-229.\n54\nĐối với những nước chưa trải qua chủ nghĩa tư bản di lên chủ nghĩa xã hội, để \nphát triển lực lượng sản xuất , nâng cao năng suất lao động, V.I.Lênin chỉ rõ tất yếu \nphải “bắc những chiếc cầu nhỏ vững chắc” xuyên qua chủ nghĩa tư bản nhà nước: \n“Trong một nước tiểu nông, trước hết các đồng chí phải bắc những chiếc cầu nhỏ\nvững chắc, đi xuyên qua chủ nghĩa tư bản nhà nước, tiến lên chủ nghĩa xã hội”1\n. \n“dưới chính quyền xô- viết thì chủ nghĩa tư bản nhà nước sẽ có thể là ¾ chủ nghĩa \nxã hội”2\n. Đồng thời, V.I.Lênin chỉ rõ, những nước chưa trải qua chủ nghĩa tư bản di \nlên chủ nghĩa xã hội cần thiết phải học hỏi kinh nghiệm tử các nước phát triển theo \ncách thức: “Dùng cả hai tay mà lấy những cái tốt của nước ngoài: Chính quyền xô-viết \n+ trật tự ở đường sắt Phổ + kỹ thuật và cách tổ chức các tơ-rớt ở Mỹ + ngành giáo dục \nquốc dân Mỹ etc. etc. + + = ∑ (tổng số) = chủ nghĩa xã hội”3\n.\nBốn là, chủ nghĩa xã hội có nhà nước kiểu mới mang bản chất giai cấp công \nnhân, đại biểu cho lợi ích, quyền lực và ý chí của nhân dân lao động.\nCác nhà sáng lập chủ nghĩa xã hội khoa học đã khẳng định trong chủ nghĩa xã \nhội phải thiết lập nhà nước chuyên chính vô sản, nhà nước kiểu mới mang bản chất của \ngiai cấp công nhân, đại biểu cho lợi ích, quyền lực và ý chí của nhân dân lao động.\nTheo V.I.Lênin, chuyên chính cách mạng của giai cấp vô sản là một chính \nquyền do giai cấp vô sản giành được và duy trì bằng bạo lực đối với giai cấp tư sản. \nChính quyền đó chính là nhà nước kiểu mới thực hiện dân chủ cho tuyệt đại đa số\nnhân dân và trấn áp bằng vũ lực bọn bóc lột, bọn áp bức nhân dân, thực chất của sự\nbiến đổi của chế độ dân chủ trong thời kỳ quá độ từ chủ nghĩa tư bản lên chủ nghĩa \ncộng sản\n4\n. Nhà nước vô sản, theo V.I.Lênin phải là một công cụ, một phương tiện; \nđồng thời, là một biểu hiện tập trung trình độ dân chủ của nhân dân lao động, phản ánh \ntrình độ nhân dân tham gia vào mọi công việc của nhà nước, quần chúng nhân dân \nthực sự tham gia vào từng bước của cuộc sống và đóng vai trò tích cực trong việc quản \nlý. Cũng theo V.I.Lênin, Nhà nước xô - viết sẽ tập hợp, lôi cuốn đông đảo nhân dân\ntham gia quản lý Nhà nước, quản lý xã hội, tổ chức đời sống xã hội vì con người và \ncho con người. Nhà nước chuyên chính vô sản đồng thời với việc mở rộng rất nhiều \nchế độ dân chủ - lần đầu tiên biến thành chế độ dân chủ cho người nghèo, chế độ dân \nchủ cho nhân dân chứ không phải cho bọn nhà giàu - chuyên chính vô sản còn thực hành \nmột loạt biện pháp hạn chế quyền tự do đối với bọn áp bức, bọn bóc lột, bọn tư bản.\nNăm là, chủ nghĩa xã hội có nền văn hóa phát triển cao, kế thừa và phát huy\nnhững giá trị của văn hóa dân tộc và tinh hoa văn nhân loại.\n1 V.I.Lênin, Toàn tập, Nxb Tiến bộ, Mátxcơva, 1976, tập.44, tr. 89.\n2 V.I.Lênin, Toàn tập, Nxb Tiến bộ, Mátxcơva, 1976, tập.36, tr. 313.\n3 V.I.Lênin, Toàn tập, Nxb. CTQG, H. 2005, tập. 36, tr.684.\n4 V.I. Lênin, Toàn tập, Nxb. Tiến bộ, Mátxcơva. 1978, tập. 33, tr.109.\n55\nTính ưu việt, sự ổn định và phát triển của chế độ xã hội chủ nghĩa không chỉ thể\nhiện ở lĩnh vực kinh tế, chính trị mà còn ở lĩnh vực văn hóa - tinh thần của xã hội.\nTrong chủ nghĩa xã hội, văn hóa là nền tảng tinh thần của xã hội, mục tiêu, \nđộng lực của phát triển xã hội, trọng tâm là phát triển kinh tế; văn hóa đã \nhun đúc nên tâm hồn, khí phách, bản lĩnh con người, biến con người thành con người \nchân, thiện mỹ."
    },
    {
      "source": "Giáo trình Chủ nghĩa xã hội khoa học (K-2021)",
      "document": "Chương III: Chủ nghĩa xã hội và thời kỳ quá độ lên chủ nghĩa xã hội",
      "topic": "chủ nghĩa xã hội",
      "page": "chunk_4",
      "credibility_score": 100,
      "source_type": "textbook",
      "text": "V.I.Lênin, trong quá trình xây dựng chủ nghĩa xã hội ở nước Nga xô - viết đã\nluận giải sâu sắc về “văn hóa vô sản” - nền văn hóa mới xã hội chủ nghĩa, rằng, chỉ\ncó xây dựng được nền văn hóa vô sản mới giải quyết được mọi vấn đề từ kinh tế, \nchính trị đến xã hội, con người. Người khẳng định: “…nếu không hiểu rõ rằng chỉ có\nsự hiểu biết chính xác về nền văn hóa được sáng tạo ra trong toàn bộ quá trình phát\ntriển của loài người và việc cải tạo nền văn hóa đó mới có thể xây dựng được nền văn\nhóa vô sản thì chúng ta không giải quyết được vấn đề”\n1\n. Đồng thời, V. I. Lênin cũng \ncho rằng, trong xã hội xã hội chủ nghĩa, những người cộng sản sẽ làm giàu tri thức\ncủa mình bằng tổng hợp các tri thức, văn hóa mà loài người đã tạo ra: “Người ta chỉ\ncó thể trở thành người cộng sản khi biết làm giàu trí óc của mình bằng sự hiểu biết tất\ncả những kho tàng tri thức mà nhân loại đã tạo ra”\n2\n. Do vậy, quá trình xây dựng nền\nvăn hóa xã hội chủ nghĩa phải biết kế thừa những giá trị văn hóa dân tộc và tinh hoa \nvăn nhân loại, đồng thời, cần chống tư tưởng, văn hóa phi vô sản, trái với những giá trị\ntruyền thống tốt đẹp của dân tộc và của loài người, trái với phương hướng đi lên chủ\nnghĩa xã hội.\nThứ sáu, chủ nghĩa xã hội bảo đảm bình đẳng, đoàn kết giữa các dân tộc và \ncó quan hệ hữu nghị, hợp tác với nhân dân các nước trên thế giới.\nVấn đề giai cấp và dân tộc, xây dựng một cộng đồng dân tộc, giai cấp bình \nđẳng, đoàn kết, hợp tác, hữu nghị với nhân dân các nước trên thế giới luôn có vị trí đặc \nbiệt quan trọng trong hoạch định và thực thi chiến lược phát triển của mỗi dân tộc và \nmỗi quốc gia. Theo quan điểm của các nhà sáng lập ra chủ nghĩa xã hội khoa học, vấn \nđề giai cấp và dân tộc có quan hệ biện chứng, bởi vậy, giải quyết vấn đề dân tộc, giai \ncấp trong chủ nghĩa xã hội có vị trí đặc biệt quan trọng và phải tuân thủ nguyên tắc: \n“xóa bỏ tình trạng người bóc lôt người thì tình trạng dân tộc này bóc lột dân tộc khác \ncũng bị xóa bỏ”\n3\n. Phát triển tư tưởng của C.Mác và Ph.Ăngghen, trong điều kiện cụ\nthể ở nước Nga, V.I.Lênin, trong Cương lĩnh về vấn đề dân tộc trong chủ nghĩa xã hội\nđã chỉ ra những nội dung có tính nguyên tắc để giải quyết vấn đề dân tộc: “Các dân tộc \nhoàn toàn bình đẳng; các dân tộc được quyền tự quyết; liên hiệp công nhân tất cả các\n1 V.I.Lênin, Toàn tập, Nxb. Tiến bộ, Mátxcơva, 1976, tập 41, tr.361.\n2 V.I.Lênin, Toàn tập, Nxb Tiến bộ, Mátxcơva, 1976, tập 41, tr.362.\n3 C.Mác và Ph.Ăngghen, Toàn tập, Nxb. CTQG, H.1995, tập 4, tr.624.\n56\ndân tộc lại. Đó là Cương lĩnh dân tộc mà chủ nghĩa Mác, kinh nghiệm toàn thế giới\nvà kinh nghiệm của nước Nga dạy cho công nhân”\n1\n. \nGiải quyết vấn đề dân tộc theo Cương lĩnh của V.I.Lênin, trong chủ nghĩa xã \nhội, cộng đồng dân tộc, giai cấp bình đẳng, đoàn kết và hợp tác trên cơ sở cơ sở chính \ntrị - pháp lý, đặc biệt là cơ sở kinh tế- xã hội và văn hóa sẽ từng bước xây dựng củng \ncố và phát triển. Đây là sự khác biệt căn bản về việc giải quyết vấn đề dân tộc theo \nquan điểm của chủ nghĩa Mác- Lênin và quan điểm của chủ nghĩa dân tộc cực đoan, \nhẹp hòi hoặc chủ nghĩa phân biệt chủng tộc. V.I.Lênin khẳng định: “… chỉ có chế độ\nxô - viết là chế độ có thể thật sự đảm bảo quyền bình đẳng giữa các dân tộc, bằng \ncách thực hiện trước hết sự đoàn kết tất cả những người vô sản, rồi đến toàn thể\nquần chúng lao động, trong việc đấu tranh chống giai cấp tư sản”2\n.\nChủ nghĩa xã hội, với bản chất tốt đẹp do con người, vì con người luôn là bảo \nđảm cho các dân tộc bình đẳng, đoàn kết và hợp tác hữu nghị; đồng thời có quan hệ\nvới nhân dân tất cả các nước trên thế giới. Tất nhiên, để xây dựng cộng đồng bình \nđẳng, đoàn kết và có quan hệ hợp tác, hữu nghị với nhân dân tất cả các nước trên thế\ngiới, điều kiện chiến thắng hoàn toàn chủ nghĩa tư bản, theo V.I.Lênin cần thiết phải có \nsự liên minh và sự thống nhất của giai cấp vô sản và toàn thể quần chúng cần lao thuộc\ntất cả các nước và các dân tộc trên toàn thế giới: “Không có sự cố gắng tự nguyện tiến\ntới sự liên minh và sự thống nhất của giai cấp vô sản, rồi sau nữa, của toàn thể quần\nchúng cần lao thuộc tất cả các nước và các dân tộc trên toàn thế giới, thì không thể chiến \nthắng hoàn toàn chủ nghĩa tư bản được”3\n. Trong “Luận cương về vấn đề dân tộc và vấn \nđề thuộc địa” văn kiện về giải quyết vấn đề dân tộc trong thời đại đế quốc chủ nghĩa và \ncách mạng vô sản, V. I. Lê-nin chỉ rõ: “Trọng tâm trong toàn bộ chính sách của Quốc \ntế Cộng sản về vấn đề dân tộc và vấn đề thuộc địa là cần phải đưa giai cấp vô sản và \nquần chúng lao động tất cả các dân tộc và các nước lại gần nhau trong cuộc đấu tranh \ncách mạng chung để lật đổ địa chủ và tư sản. Bởi vì, chỉ có sự gắn bó như thế mới bảo \nđảm cho thắng lợi đối với chủ nghĩa tư bản, không có thắng lợi đó thì không thể tiêu \ndiệt được ách áp bức dân tộc và sự bất bình đẳng”4\n. Đó cũng là cơ sở để Người đưa ra \nkhẩu hiệu: “Vô sản tất cả các nước và các dân tộc bị áp bức đoàn kết lại”. \nBảo đảm bình đẳng, đoàn kết giữa các dân tộc và có quan hệ hợp tác, hữu nghị\nvới nhân dân tất cả các nước trên thế giới, chủ nghĩa xã hội mở rộng được ảnh hưởng\nvà góp phần tích cực vào cuộc đấu tranh chung của nhân dân thế giới vì hòa bình,\nđộc lập dân tộc, dân chủ và tiến bộ xã hội.\n1 V.I.Lênin, Toàn tập, Nxb. Tiến bộ, Mátxcơva. 1976, tập. 25, tr.375.\n2 V.I.Lênin, Toàn tập, Nxb. Tiến bộ, Mátxcơva, 1976, tập. 41, tr.202.\n3 V.I.Lênin, Toàn tập, Nxb Tiến bộ, Mátxcơva, 1976, tập. 41 tr.206.\n4 Viện Mác - Lênin, V. I. Lênin và Quốc tế Cộng sản, Nxb. Sách chính trị, Mát-xcơ-va, 1970, Tiếng \nNga, tr199.\n57\n2. Thời kỳ quá độ lên chủ nghĩa xã hội\n2.1. Tính tất yếu khách quan của thời kỳ quá độ lên chủ nghĩa xã hội \nHọc thuyết hình thái kinh tế- xã hội của chủ nghĩa Mác- Lênin đã chỉ rõ: lịch sử\nxã hội đã trải qua 5 hình thái kinh tế- xã hội: Cộng sản nguyên thủy, chiếm hữu nô lệ, \nphong kiến, tư bản chủ nghĩa và cộng sản chủ nghĩa. So với các hình thái kinh tế xã \nhội đã xuất hiện trong lịch sử, hình thái kinh tế- xã hội cộng sản chủ nghĩa có sự khác \nbiệt về chất, trong đó không có giai cấp đối kháng, con người từng bước trở thành \nngười tự do…,. Bởi vậy, theo quan điểm của chủ nghĩa Mác- Lênin, từ chủ nghĩa tư \nbản lên chủ nghĩa xã hội tất yếu phải trải qua thời kỳ quá độ chính trị. C. Mác khẳng \nđịnh: “Giữa xã hội tư bản chủ nghĩa và xã hội cộng sản chủ nghĩa là một thời kỳ cải \nbiến cách mạng từ xã hội này sang xã hội kia. Thích ứng với thời kỳ ấy là một thời kỳ\nquá độ chính trị, và nhà nước của thời kỳ ấy không thể là cái gì khác hơn là nền \nchuyên chính cách mạng của giai cấp vô sản”1\n. V.I.Lênin trong điều kiện nước Nga \nxô- viết cũng khẳng định: “Về lý luận, không thể nghi ngờ gì được rằng giữa chủ\nnghĩa tư bản và chủ nghĩa cộng sản, có một thời kỳ quá độ nhất định”2\n. Khẳng định \ntính tất yếu của thời kỳ quá độ, đồng thời các nhà sáng lập chủ nghĩa xa hội khoa học \ncũng phân biệt có hai loại quá độ từ chủ nghĩa tư bản lên chủ nghĩa cộng sản: 1) Quá \nđộ trực tiếp từ chủ nghĩa tư bản lên chủ nghĩa cộng sản đối với những nước đã trải qua \nchủ nghĩa tư bản phát triển. Cho đến nay thời kỳ quá độ trực tiếp lên chủ nghĩa cộng \nsản từ chủ nghĩa tư bản phát triển chưa từng diễn ra; 2) Quá độ gián tiếp từ chủ nghĩa \ntư bản lên chủ nghĩa cộng sản đối với những nước chưa trải qua chủ nghĩa tư bản phát \ntriển. Trên thế giới một thế kỷ qua, kể cả Liên Xô và các nước Đông Âu trước đây, \nTrung Quốc, Việt Nam và một số nước xã hội chủ nghĩa khác ngày nay, theo đúng lý \nluận Mác - Lênin, đều đang trải qua thời kỳ quá độ gián tiếp với những trình độ phát \ntriển khác nhau.\nXuất phát từ quan điểm cho rằng: chủ nghĩa cộng sản không phải là một trạng \nthái cần sáng tạo ra , không phải là một lý tưởng mà hiện thực phải tuân theo mà là kết \nquả của phong trào hiện thực, các nhà sáng lập chủ nghĩa xã hội khoa học cho rằng: \nCác nước lạc hậu với sự giúp đỡ của giai cấp vô sản đã chiến thắng có thể rút ngắn \nđược quá trình phát triển: “với sự giúp đỡ của giai cấp vô sản đã chiến thắng, các dân \ntộc lạc hậu có thể rút ngắn khá nhiều quá trình phát triển của mình lên xã hội xã hội \nchủ nghĩa và tránh được phần lớn những đau khổ và phần lớn các cuộc đấu tranh mà \nchúng ta bắt buộc phải trải qua ở Tây Âu”3\n. C.Mác, khi tìm hiểu về nước Nga cũng chỉ\nrõ: “Nước Nga… có thể không cần trải qua đau khổ của chế độ (chế độ tư bản chủ nghĩa -\n1 C. Mác và Ph.Ăngghen, Toàn tập, Nxb. CTQG, H. 1983, tập 19, tr. 47.\n2 V.I.Lênin, Toàn tập, Nxb. Tiến bộ, Matxcơva. 1977, tập 39, tr. 309-310.\n3 Từ điển Chủ nghĩa cộng sản khoa học, Nxb Sự thật, Hà Nội, 1986, tr. 55.\n58\nTG) mà vẫn chiếm đoạt được mọi thành quả của chế độ ấy”1\n.\nVận dụng và phát triển quan điểm của C. Mác và Ph.Ăngghen trong điều kiện \nmới, sau cách mạng tháng Mười, V.I.Lênin khẳng định: “với sự giúp đỡ của giai cấp \nvô sản các nước tiên tiến, các nước lạc hậu có thể tiến tới chế độ xô - viết, và qua \nnhững giai đoạn phát triển nhất định, tiến tới chủ nghĩa cộng sản không phải trải qua giai \nđoạn phát triển tư bản chủ nghĩa (hiểu theo nghĩa con đường rút ngắn - TG)”2\n.\nQuán triệt và vận dụng, phát triển sáng tạo những lý của chủ nghĩa Mác- Lênin, \ntrong thời đại ngay nay, thời đại quá độ từ chủ nghĩa tư bản lên chủ nghĩa xã hội trên \nphạm vi toàn thế giới, chúng ta có thể khẳng định: Với lợi thế của thời đại, trong bối \ncảnh toàn cầu hóa và cách mạng công nghiệp 4.0, các nước lạc hậu, sau khi giành \nđược chính quyền, dưới sự lãnh đạo của Đảng Cộng sản có thể tiến thẳng lên chủ\nnghĩa xã hội chủ nghĩa bỏ qua chế độ tư bản chủ nghĩa.\n2.2. Đặc điểm thời kỳ quá độ lên chủ nghĩa xã hội\nThực chất của thời kỳ quá độ lên chủ nghĩa xã hội là thời kỳ cải biến cách mạng \ntừ xã hội tiền tư bản chủ nghĩa và tư bản chủ nghĩa sang xã hội xã hội chủ nghĩa. Xã \nhội của thời kỳ quá độ là xã hội có sự đan xen của nhiều tàn dư về mọi phương diện \nkinh tế, đạo đức, tinh thần của chủ nghĩa tư bản và những yếu tố mới mang tính chất \nxã hội chủ nghĩa của chủ nghĩa xã hội mới phát sinh chưa phải là chủ nghĩa xã hội đã\nphát triển trên cơ sở của chính nó. \nVề nội dung, thời kỳ quá độ lên chủ nghĩa xã hội là thời kỳ cải tạo cách mạng sâu sắc, triệt \nđể xã hội tư bản chủ nghĩa trên tất cả các lĩnh vực, kinh tế, chính trị, văn hóa, xã hội, xây dựng từng \nbước cơ sở vật chất- kỹ thuật và đời sống tinh thần của chủ nghĩa xã hội. Đó là thời kỳ lâu dài, gian \nkhổ bắt đầu từ khi giai cấp công nhân và nhân dân lao động giành được chính quyền đến khi xây dựng \nthành công chủ nghĩa xã hội. Có thể khái quát những đặc điểm cơ bản của thời kỳ quá độ lên chủ\nnghĩa xã hội như sau: \n- Trên lĩnh vực kinh tế\nThời kỳ quá độ từ chủ nghĩa tư bản lên chủ nghĩa xã hội, về phương diện kinh tế, \ntất yếu tồn tại nền kinh tế nhiều thành phần, trong đó có thành phần đối lập. Đề cập tới \nđặc trưng này, V.I.Lênin cho rằng: “Vậy thì danh từ quá độ có nghĩa là gì? Vận dụng \nvào kinh tế, có phải nó có nghĩa là trong chế độ hiện nay có những thành phần, những \nbộ phận, những mảnh của cả chủ nghĩa tư bản lẫn chủ nghĩa xã hội không? Bất cứ ai \ncũng thừa nhận là có. Song không phải mỗi người thừa nhận điểm ấy đều suy nghĩ xem \ncác thành phần của kết cấu kinh tế- xã hội khác nhau hiện có ở Nga, chính là như thế\nnào?. Mà tất cả then chốt của vấn đề lại chính là ở đó”3\n. Tương ứng với nước Nga, V.I \n1 C. Mác và Ph.Ăngghen, Toàn tập, Nxb. CTQG, H. 1983, tập. 22, tr. 636.\n2 V.I. Lênin, Toàn tập, Nxb. Tiến bộ, Matxcơva. 1977, tập. 41, tr. 295.\n3 V.I. Lênin, Toàn tập, Nxb. Tiến bộ, Matxcơva. 1978, tập. 36, tr. 362.\n59\nLênin cho rằng thời kỳ quá độ tồn tại 5 thành phần kinh tế: Kinh tế gia trưởng; kinh tế\nhàng hóa nhỏ; kinh tế tư bản; kinh tế tư bản nhà nước; kinh tế xã hội chủ nghĩa.\n- Trên lĩnh vực chính trị\nThời kỳ quá độ từ chủ nghĩa tư bản lên chủ nghĩa xã hội về phương diện chính \ntrị, là việc thiết lập, tăng cường chuyên chính vô sản mà thực chất của nó là việc giai \ncấp công nhân nắm và sử dụng quyền lực nhà nước trấn áp giai cấp tư sản, tiến hành \nxây dựng một xã hội không giai cấp. Đây là sự thống trị về chính trị của giai cấp công \nnhân với chức năng thực hiện dân chủ đối với nhân dân, tổ chức xây dựng và bảo vệ\nchế độ mới, chuyên chính với những phần tử thù địch, chống lại nhân dân; là tiếp tục \ncuộc đấu tranh giai cấp giữa giai cấp vô sản đã chiến thắng nhưng chưa phải đã toàn \nthắng với giai cấp tư sản đã thất bại nhưng chưa phải thất bại hoàn toàn. Cuộc đấu \ntranh diễn ra trong điều kiện mới- giai cấp công nhân đã trở thành giai cấp cầm quyền, \nvới nội dung mới- xây dựng toàn diện xã hội mới, trọng tâm là xây dựng nhà nước có \ntính kinh tế, và hình thức mới- cơ bản là hòa bình tổ chức xây dựng.\n- Trên lĩnh vực tư tưởng - văn hóa\nThời kỳ quá độ từ chủ nghĩa tư bản lên chủ nghĩa xã hội còn tồn tại nhiều tư \ntưởng khác nhau, chủ yếu là tư tưởng vô sản và tư tưởng tư sản. Giai cấp công nhân \nthông qua đội tiền phong của mình là Đảng Cộng sản từng bước xây dựng văn hóa vô \nsản, nền văn hoá mới xã hội chủ nghĩa, tiếp thu giá trị văn hóa dân tộc và tinh hoa \nvăn hóa nhân loại, bảo đảm đáp ứng nhu cầu văn hóa- tinh thần ngày càng tăng của \nnhân dân. \n- Trên lĩnh vực xã hội\nDo kết cấu của nền kinh tế nhiều thành phần qui định nên trong thời kỳ quá độ\ncòn tồn tại nhiều giai cấp, tầng lớp và sự khác biệt giữa các giai cấp tầng lớp xã hội, \ncác giai cấp, tầng lớp vừa hợp tác, vừa đấu tranh với nhau. Trong xã hội của thời kỳ\nquá độ còn tồn tại sự khác biệt giữa nông thôn, thành thị, giữa lao động trí óc và lao \nđộng chân tay. Bởi vậy, thời kỳ quá độ từ chủ nghĩa tư bản lên chủ nghĩa xã hội, về\nphương diện xã hội là thời kỳ đấu tranh giai cấp chống áp bức, bất công, xóa bỏ tệ nạn \nxã hội và những tàn dư của xã hội cũ để lại, thiết lập công bằng xã hội trên cơ sở thực \nhiện nguyên tắc phân phối theo lao động là chủ đạo. \n3. Quá độ lên chủ nghĩa xã hội ở Việt Nam\n3.1. Quá độ lên chủ nghĩa xã hội bỏ qua chế độ tư bản chủ nghĩa\nViệt Nam tiến lên chủ nghĩa xã hội trong điều kiện vừa thuận lợi vừa khó khăn \nđan xen, có những đặc trưng cơ bản:\n- Xuất phát từ một xã hội vốn là thuộc địa, nửa phong kiến, lực lượng sản xuất \nrất thấp. Đất nước trải qua chiến tranh ác liệt, kéo dài nhiều thập kỷ, hậu quả để lại còn \nnặng nề. Những tàn dư thực dân, phong kiến còn nhiều. Các thế lực thù địch thường \nxuyên tìm cách phá hoại chế độ xã hội chủ nghĩa và nền độc lập dân tộc của nhân dân ta.\n- Cuộc cách mạng khoa học và công nghệ hiện đại đang diễn ra mạnh mẽ, cuốn \nhút tất cả các nước ở mức độ khác nhau. Nền sản xuất vật chất và đời sống xã hội đang \ntrong quá trình quốc tế hoá sâu sắc, ảnh hưởng lớn tới nhịp độ phát triển lịch sử và \ncuộc sống các dân tộc. Những xu thế đó vừa tạo thời cơ phát triển nhanh cho các nước, \nvừa đặt ra những thách thức gay gắt.\n- Thời đại ngày nay vẫn là thời đại quá độ từ chủ nghĩa tư bản lên chủ nghĩa xã \nhội, cho dù chế độ xã hội chủ nghĩa ở Liên Xô và Đông Âu sụp đổ. Các nước với chế \nđộ xã hội và trình độ phát triển khác nhau cùng tồn tại, vừa hợp tác vừa đấu tranh, \ncạnh tranh gay gắt vì lợi ích quốc gia, dân tộc. Cuộc đấu tranh của nhân dân các nước \nvì hoà bình, độc lập dân tộc, dân chủ, phát triển và tiến bộ xã hội dù gặp nhiều khó \nkhăn, thách thức, song theo quy luật tiến hoá của lịch sử, loài người nhất định sẽ tiến \ntới chủ nghĩa xã hội.\nQuá độ lên chủ nghĩa xã hội bỏ qua chế độ tư bản chủ nghĩa là sự lựa chọn duy \nnhất đúng, khoa học, phản ánh đúng qui luật phát triển khách quan của cách mạng Việt \nNam trong thời đại ngày nay. Cương lĩnh năm 1930 của Đảng đã chỉ rõ: Sau khi hoàn \nthành cách mạng dân tộc, dân chủ nhân dân, sẽ tiến lên chủ nghĩa xã hội. Đây là sự lựa \nchọn dứt khoát và đúng đắn của Đảng, đáp ứng nguyện vọng thiết tha của dân tộc, \nnhân dân, phản ánh xu thế phát triển của thời đại, phù hợp với quan điểm khoa học, \ncách mạng và sáng tạo của chủ nghĩa Mác - Lênin. \nQuá độ lên chủ nghĩa xã hội bỏ qua chế độ tư bản chủ nghĩa, như Đại hội IX \ncủa Đảng Cộng sản Việt Nam xác định: Con đường đi lên của nước ta là sự phát triển \nquá độ lên chủ nghĩa xã hội bỏ qua chế độ tư bản chủ nghĩa, tức là bỏ qua việc xác lập \nvị trí thống trị của quan hệ sản xuất và kiến trúc thượng tầng tư bản chủ nghĩa, nhưng \ntiếp thu, kế thừa những thành tựu mà nhân loại đã đạt được dưới chế độ tư bản chủ \nnghĩa, đặc biệt về khoa học và công nghệ, để phát triển nhanh lực lượng sản xuất, xây \ndựng nền kinh tế hiện đại.\nĐây là tư tưởng mới, phản ánh nhận thức mới, tư duy mới của Đảng ta về con \nđường đi lên chủ nghĩa xã hội bỏ qua chế độ tư bản chủ nghĩa. Tư tưởng này cần \nđược hiểu đầy đủ với những nội dung sau đây:\nThứ nhất, quá độ lên chủ nghĩa xã hội bỏ qua chế độ tư bản chủ nghĩa là con \nđường cách mạng tất yếu khách quan, con đường xây dựng đất nước trong thời kỳ quá \nđộ lên chủ nghĩa xã hội ở nước ta.\nThứ hai, quá độ lên chủ nghĩa xã hội bỏ qua chế độ tư bản chủ nghĩa, tức là bỏ \nqua việc xác lập vị trí thống trị của quan hệ sản xuất và kiến trúc thượng tầng tư bản \nchủ nghĩa. Điều đó có nghĩa là trong thời kỳ quá độ còn nhiều hình thức sở hữu, nhiều \n60\n61\nthành phần kinh tế, song sở hữu tư nhân tư bản chủ nghĩa và thành phần kinh tế tư \nnhân tư bản tư bản chủ nghĩa không chiếm vai trò chủ đạo; thời kỳ quá độ còn nhiều \nhình thức phân phối, ngoài phân phối theo lao động vẫn là chủ đạo còn phân phối theo \nmức độ đóng góp và quĩ phúc lợi xã hội; thời kỳ quá độ vẫn còn quan hệ bóc lột và bị \nbóc lột, song quan hệ bóc lột tư bản chủ nghĩa không giữ vai trò thống trị.\nThứ ba, quá độ lên chủ nghĩa xã hội bỏ qua chế độ tư bản chủ nghĩa đòi hỏi \nphải tiếp thu, kế thừa những thành tựu mà nhân loại đã đạt được dưới chủ nghĩa tư \nbản, đặc biệt là những thành tựu về khoa học và công nghệ, thành tựu về quản lý để \nphát triển xã hội, quản lý phát triển xã hội, đặc biệt là xây dựng nền kinh tế hiện đại, \nphát triển nhanh lực lượng sản xuất.\nThứ tư, quá độ lên chủ nghĩa xã hội bỏ qua chế độ tư bản chủ nghĩa là tạo ra sự\nbiến đổi về chất của xã hội trên tất cả các lĩnh vực, là sự nghiệp rất khó khăn, phức \ntạp, lâu dài với nhiều chặng đường, nhiều hình thức tổ chức kinh tế, xã hội có tính chất \nquá độ đòi hỏi phái có quyết tâm chính trị cao và khát vọng lớn của toàn Đảng, toàn dân. \n3.2. Những đặc trưng của chủ nghĩa xã hội và phương hướng xây dựng chủ nghĩa \nxã hội ở Việt Nam hiện nay \n3.2.1.Những đặc trưng bản chất của chủ nghĩa xã hội Việt Nam \nVận dụng sáng tạo và phát triển chủ nghĩa Mác- Lênin vào điều kiện cụ thể của \nViệt Nam, tổng kết thực tiễn quá trình cách mạng Việt Nam, nhất là qua hơn 30 năm \nđổi mới, nhận thức của Đảng và nhân dân dân ta về chủ nghĩa xã hội và con đường đi \nlên chủ nghĩa xã hội ngày càng sáng rỏ. Đại hội IV (1976), nhận thức của Đảng ta về\nchủ nghĩa xã hội và con đường phát triển của cách mạng nước ta mới dừng ở mức độ\nđịnh hướng: Trên cơ sở phương hướng đúng, hãy hành động thực tế cho câu trả lời. \nĐến Đại hội VII, nhận thức của Đảng Cộng sản Việt Nam về chủ nghĩa xã hội và con \nđường đi lên chủ nghĩa đã sáng tỏ hơn, không chỉ dừng ở nhận thức định hướng, định \ntính mà từng bước đạt tới trình độ đình hình, định lượng. Cương lĩnh xây dựng đất \nnước trong thời kỳ quá độ lên chủ nghĩa xã hội (1991), đã xác định mô hình chủ nghĩa \nxã hội ở nước ta với sáu đặc trưng1\n. Đến Đại hội XI, trên cơ sở tổng kết 25 năm đổi \nmới, nhận thức của Đảng ta về chủ nghĩa xã hội và con đường đi lên chủ nghĩa xã hội \nđã có bước phát triển mới. Cương lĩnh xây dựng đất nước trong thời kỳ quá độ lên chủ\nnghĩa xã hội (bổ sung, phát triển năm 2011) đã phát triển mô hình chủ nghĩa xã hội \nViệt Nam với tám đặc trưng, trong đó có đặc trưng về mục tiêu, bản chất, nội dung \n1 1) Do nhân dân lao động làm chủ; 2) Có một nền kinh tế phát triển cao dựa trên lực lượng sản\nxuất hiện đại và chế độ công hữu về các tư liệu sản xuất chủ yếu; 3) Có nền văn hóa tiên tiến, đậm \nđà bản sắc dân tộc; 4) Con người được giải phóng khỏi áp bức, bóc lột, bất công, làm theo năng lực,\nhưởng theo lao động, có cuộc sống ấm no, tự do hạnh phúc, có điều kiện phát triển toàn diện cá nhân; \n5) Các dân tộc trong nước bình đẳng, đoàn kết và giúp đỡ lẫn nhau cùng tiến bộ; 6) Có quan hệ hữu\nnghị và hợp tác với nhân dân tất cả các nước trên thế giới”.\n62\ncủa xã hội xã hội chủ nghĩa mà nhân dân ta xây dựng, đó là:\nMột là: Dân giàu, nước mạnh, dân chủ, công bằng, văn minh.\nHai là: Do nhân dân làm chủ.\nBa là: Có nền kinh tế phát triển cao dựa trên lực lượng sản xuất hiện đại và \nquan hệ sản xuất tiến bộ phù hợp.\nBốn là: Có nền văn hóa tiên tiến, đậm đà bản sắc dân tộc.\nNăm là: Con người có cuộc sống ấm no, tự do, hạnh phúc, có điều kiện phát \ntriển toàn diện.\nSáu là: Các dân tộc trong cộng đồng Việt Nam bình đẳng, đoàn kết, tôn trọng \nvà giúp nhau cùng phát triển.\nBảy là: Có Nhà nước pháp quyền xã hội chủ nghĩa của nhân dân, do nhân dân, \nvì nhân dân do Đảng Cộng sản lãnh đạo.\nTám là: Có quan hệ hữu nghị và hợp tác với các nước trên thế giới1\n.\n3.2.2 Phương hướng xây dựng chủ nghĩa xã hội ở Việt Nam hiện nay\nTrên cơ sở xác định rõ mục tiêu, đặc trưng của chủ nghĩa xã hôi, những nhiệm \nvụ của sự nghiệp xây dựng đất nước trong thời kỳ quá độ lên chủ nghĩa xã hội, Đảng \nta, đã xác định tám phương hướng cơ bản đòi hỏi toàn Đảng, toàn quân và toàn dân ta \ncần nêu cao tinh thần cách mạng tiến công, ý chí tự lực tự cường, phát huy mọi tiềm \nnăng và trí tuệ, tận dụng thời cơ, vượt qua thách thức xây dựng đất nước ta to đẹp hơn, \nđàng hoàng hơn.\nCương lĩnh xây dựng đất nước trong thời quá độ lên chủ nghĩa xã hội (1991) xác \nđịnh 7 phương hướng cơ bản phản ánh con đường quá độ lên chủ nghĩa xã hội ở nước \nta2\n. Đại hội XI, trong Cương lĩnh xây dựng đất nước trong thời quá độ lên chủ nghĩa xã \n1 http://tulieuvankien.dangcongsan.vn/ban-chap-hanh-trung-uong-dang/dai-hoi-dang/lan-thu-xi/cuong￾linh-xay-dung-dat-nuoc-trong-thoi-ky-qua-do-len-chu-nghia-xa-hoi-bo-sung-phat-trien-nam-2011-\n1528\n2 1) xây dựng Nhà nước xã hội chủ nghĩa, Nhà nước của nhân dân, do nhân dân, vì nhân dân, lấy liên \nminh giai cấp công nhân với giai cấp nông dân và tầng lớp trí thức làm nền tảng, do đảng cộng sản \nlãnh đạo. Thực hiện đầy đủ quyền dân chủ của nhân dân, giữ nghiêm kỷ cương xã hội, chuyên chính \nvới mọi hành động xâm phạm lợi ích của Tổ quốc và của nhân dân; 2) phát triển lực lượng sản xuất, \ncông nghiệp hoá đất nước theo hướng hiện đại gắn liền với phát triển một nền nông nghiệp toàn diện \nlà nhiệm vụ trung tâm nhằm từng bước xây dựng cơ sở vật chất - kỹ thuật của chủ nghĩa xã hội, không \nngừng nâng cao năng suất lao động xã hội và cải thiện đời sống nhân dân; 3) phù hợp với sự phát triển \ncủa lực lượng sản xuất, thiết lập từng bước quan hệ sản xuất xã hội chủ nghĩa từ thấp đến cao với sự \nđa dạng về hình thức sở hữu. Phát triển nền kinh tế hàng hoá nhiều thành phần theo định hướng xã hội \nchủ nghĩa, vận hành theo cơ chế thị trường có sự quản lý của Nhà nước. Kinh tế quốc doanh và kinh tế\ntập thể ngày càng trở thành nền tảng của nền kinh tế quốc dân. Thực hiện nhiều hình thức phân phối, \nlấy phân phối theo kết quả lao động và hiệu quả kinh tế là chủ yếu;4) tiến hành cách mạng xã hội chủ \nnghĩa trên lĩnh vực tư tưởng và văn hoá làm cho thế giới quan Mác - Lênin và tư tưởng, đạo đức Hồ \nhội (Bổ sung và phát triển năm 2011) xác định 8 phương hướng, phản ánh con đường \nđi lên chủ nghĩa xã hội ở nước ta, đó là: \nMột là, đẩy mạnh công nghiệp hoá, hiện đại hoá đất nước gắn với phát triển \nkinh tế tri thức, bảo vệ tài nguyên, môi trường.\nHai là, phát triển nền kinh tế thị trường định hướng xã hội chủ nghĩa.\nBa là, xây dựng nền văn hoá tiên tiến, đậm đà bản sắc dân tộc; xây dựng con \nngười, nâng cao đời sống nhân dân, thực hiện tiến bộ và công bằng xã hội.\nBốn là, bảo đảm vững chắc quốc phòng và an ninh quốc gia, trật tự, an toàn xã hội.\nNăm là, thực hiện đường lối đối ngoại độc lập, tự chủ, hoà bình, hữu nghị, hợp \ntác và phát triển; chủ động và tích cực hội nhập quốc tế.\nSáu là, xây dựng nền dân chủ xã hội chủ nghĩa, thực hiện đại đoàn kết toàn dân \ntộc, tăng cường và mở rộng mặt trận dân tộc thống nhất.\nBảy là, xây dựng Nhà nước pháp quyền xã hội chủ nghĩa của nhân dân, do nhân \ndân, vì nhân dân.\nTám là, xây dựng Đảng trong sạch, vững mạnh.\nTrong quá trình thực hiện các phương hướng cơ bản đó, Đảng yêu cầu phải đặc \nbiệt chú trọng nắm vững và giải quyết tốt các mối quan hệ lớn: quan hệ giữa đổi mới, \nổn định và phát triển; giữa đổi mới kinh tế và đổi mới chính trị; giữa kinh tế thị trường \nvà định hướng xã hội chủ nghĩa; giữa phát triển lực lượng sản xuất và xây dựng, hoàn \nthiện từng bước quan hệ sản xuất xã hội chủ nghĩa; giữa tăng trưởng kinh tế và phát \ntriển văn hoá, thực hiện tiến bộ và công bằng xã hội; giữa xây dựng chủ nghĩa xã hội \nvà bảo vệ Tổ quốc xã hội chủ nghĩa; giữa độc lập, tự chủ và hội nhập quốc tế; giữa \nĐảng lãnh đạo, Nhà nước quản lý, nhân dân làm chủ;... Không phiến diện, cực đoan, \nduy ý chí.\nChí Minh giữ vị trí chỉ đạo trong đời sống tinh thần xã hội. Kế thừa và phát huy những truyền thống \nvăn hoá tốt đẹp của tất cả các dân tộc trong nước, tiếp thu những tinh hoa văn hoá nhân loại, xây dựng \nmột xã hội dân chủ, văn minh vì lợi ích chân chính và phẩm giá con người, với trình độ tri thức, đạo \nđức, thể lực và thẩm mỹ ngày càng cao. Chống tư tưởng, văn hoá phản tiến bộ, trái với những truyền \nthống tốt đẹp của dân tộc và những giá trị cao quý của loài người, trái với phương hướng đi lên chủ \nnghĩa xã hội; 5) thực hiện chính sách đại đoàn kết dân tộc, củng cố và mở rộng Mặt trận dân tộc thống \nnhất, tập hợp mọi lực lượng phấn đấu vì sự nghiệp dân giàu, nước mạnh. Thực hiện chính sách đối \nngoại hoà bình, hợp tác và hữu nghị với tất cả các nước; trung thành với chủ nghĩa quốc tế của giai cấp \ncông nhân, đoàn kết với các nước xã hội chủ nghĩa, với tất cả các lực lượng đấu tranh vì hoà bình, độc \nlập dân tộc, dân chủ và tiến bộ xã hội trên thế giới; 6) xây dựng chủ nghĩa xã hội và bảo vệ Tổ quốc là \nhai nhiệm vụ chiến lược của cách mạng Việt Nam. Trong khi đặt lên hàng đầu nhiệm vụ xây dựng đất \nnước, nhân dân ta luôn luôn nâng cao cảnh giác, củng cố quốc phòng, bảo vệ an ninh chính trị, trật tự \nan toàn xã hội, bảo vệ Tổ quốc và các thành quả cách mạng; 7) xây dựng Đảng trong sạch, vững \nmạnh về chính trị, tư tưởng và tổ chức ngang tầm nhiệm vụ, bảo đảm cho Đảng làm tròn trách nhiệm \nlãnh đạo sự nghiệp cách mạng xã hội chủ nghĩa ở nước ta.\n63\n64\nThực hiện tám phương hướng và giải quyết thành công những mối quan hệ lớn \nchính là đưa cách mạng nước ta theo đúng con đường phát triển quá độ lên chủ nghĩa \nxã hội bỏ qua chế độ tư bản chủ nghĩa ở nước ta. \nTổng kết 30 năm đổi mới, đất nước ta đã đạt được những thành tựu to lớn, có ý \nnghĩa lịch sử trên con đường xây dựng chủ nghĩa xã hội và bảo vệ Tổ quốc xã hội chủ\nnghĩa Đại hội XII của Đảng Cộng sản Việt Nam (2016) từ bài học kinh nghiệm của 30 \nnăm đổi mới, trong quá trình đổi mới phải chủ động, không ngừng sáng tạo trên cơ sở\nkiên định mục tiêu độc lập dân tộc và chủ nghĩa xã hội, vận dụng sáng tạo và phát triển \nchủ nghĩa Mác - Lênin, tư tưởng Hồ Chí Minh, kế thừa và phát huy truyền thống dân \ntộc, tiếp thu tinh hoa văn hóa nhân loại, vận dụng kinh nghiệm quốc tế phù hợp với \nViệt Nam, đã xác định mục tiêu từ nay đến giữa thế kỷ XXI, toàn Đảng, toàn dân ta \nphải ra sức “ Tăng cường xây dựng Đảng trong sạch, vững mạnh, nâng cao năng lực \nlãnh đạo và sức chiến đấu của Đảng, xây dựng hệ thống chính trị vững mạnh. Phát huy \nsức mạnh toàn dân tộc và dân chủ xã hội chủ nghĩa. Đẩy mạnh toàn diện, đồng bộ\ncông cuộc đổi mới; phát triển kinh tế nhanh, bền vững, phấn đấu sớm đưa nước ta cơ \nbản trở thành nước công nghiệp theo hướng hiện đại”1\n. Để thực hiện thành công các \nmục tiêu trên, toàn Đảng, toàn dân ta cần nêu cao tinh thần cách mạng tiến công, ý chí \ntự lực tự cường, phát huy mọi tiềm năng và trí tuệ, tận dụng thời cơ, vượt qua thách \nthức, quán triệt và thực hiện tốt 12 nhiệm vụ cơ bản sau đây:\n(1) Phát triển kinh tế nhanh và bền vững; tăng trưởng kinh tế cao hơn 5 năm \ntrước trên cơ sở giữ vững ổn định kinh tế vĩ mô, đổi mới mô hình tăng trưởng, cơ cấu \nlại nền kinh tế; đẩy mạnh công nghiệp hóa, hiện đại hóa, chú trọng công nghiệp hóa, \nhiện đại hóa nông nghiệp, nông thôn gắn với xây dựng nông thôn mới; phát triển kinh \ntế tri thức, nâng cao trình độ khoa học, công nghệ của các ngành, lĩnh vực; nâng cao \nnăng suất, chất lượng, hiệu quả, sức cạnh tranh của nền kinh tế; xây dựng nền kinh tế\nđộc lập, tự chủ, tham gia có hiệu quả vào mạng sản xuất và chuỗi giá trị toàn cầu.\n(2) Tiếp tục hoàn thiện thể chế, phát triển kinh tế thị trường định hướng xã hội \nchủ nghĩa; nâng cao hiệu lực, hiệu quả, kỷ luật, kỷ cương, công khai, minh bạch trong \nquản lý kinh tế, năng lực quản lý của Nhà nước và năng lực quản trị doanh nghiệp.\n(3) Đổi mới căn bản và toàn diện giáo dục, đào tạo, nâng cao chất lượng nguồn \nnhân lực; đẩy mạnh nghiên cứu, phát triển, ứng dụng khoa học, công nghệ; phát huy \nvai trò quốc sách hàng đầu của giáo dục, đào tạo và khoa học, công nghệ đối với sự\nnghiệp đổi mới và phát triển đất nước.\n1 http://tulieuvankien.dangcongsan.vn/ban-chap-hanh-trung-uong-dang/dai-hoi-dang/lan-thu-xii/bao￾cao-chinh-tri-cua-ban-chap-hanh-trung-uong-dang-khoa-xi-tai-dai-hoi-dai-bieu-toan-quoc-lan-thu-xii￾cua-dang-1600\n(4) Xây dựng nền văn hóa Việt Nam tiên tiến, đậm đà bản sắc dân tộc, con \nngười Việt Nam phát triển toàn diện đáp ứng yêu cầu phát triển bền vững đất nước và \nbảo vệ vững chắc Tổ quốc xã hội chủ nghĩa.\n(5) Quản lý tốt sự phát triển xã hội; bảo đảm an sinh xã hội, nâng cao phúc lợi \nxã hội; thực hiện tốt chính sách với người có công; nâng cao chất lượng chăm sóc sức \nkhoẻ nhân dân, chất lượng dân số, chất lượng cuộc sống của nhân dân; thực hiện tốt \nchính sách lao động, việc làm, thu nhập; xây dựng môi trường sống lành mạnh, văn \nminh, an toàn. \n(6) Khai thác, sử dụng và quản lý hiệu quả tài nguyên thiên nhiên; bảo vệ môi \ntrường; chủ động phòng, chống thiên tai, ứng phó với biến đổi khí hậu.\n(7) Kiên quyết, kiên trì đấu tranh bảo vệ vững chắc độc lập, chủ quyền, thống \nnhất, toàn vẹn lãnh thổ của Tổ quốc, bảo vệ Đảng, Nhà nước, nhân dân và chế độ xã \nhội chủ nghĩa; giữ vững an ninh chính trị, trật tự, an toàn xã hội. Củng cố, tăng cường \nquốc phòng, an ninh. Xây dựng nền quốc phòng toàn dân, nền an ninh nhân dân vững \nchắc; xây dựng lực lượng vũ trang nhân dân cách mạng, chính quy, tinh nhuệ, từng \nbước hiện đại, ưu tiên hiện đại hóa một số quân chủng, binh chủng, lực lượng.\n(8) Thực hiện đường lối đối ngoại độc lập, tự chủ, đa phương hóa, đa dạng hóa, \nchủ động và tích cực hội nhập quốc tế; giữ vững môi trường hòa bình, ổn định, tạo \nđiều kiện thuận lợi cho sự nghiệp xây dựng và bảo vệ Tổ quốc; nâng cao vị thế, uy tín \ncủa Việt Nam trong khu vực và trên thế giới.\n(9) Hoàn thiện, phát huy dân chủ xã hội chủ nghĩa và quyền làm chủ của nhân \ndân; không ngừng củng cố, phát huy sức mạnh của khối đại đoàn kết toàn dân tộc; \ntăng cường sự đồng thuận xã hội; tiếp tục đổi mới nội dung và phương thức hoạt động \ncủa Mặt trận Tổ quốc và các đoàn thể nhân dân.\n(10) Tiếp tục hoàn thiện Nhà nước pháp quyền xã hội chủ nghĩa, xây dựng bộ\nmáy nhà nước tinh gọn, trong sạch, vững mạnh; hoàn thiện hệ thống pháp luật, đẩy \nmạnh cải cách hành chính, cải cách tư pháp, xây dựng đội ngũ cán bộ, công chức, viên \nchức có phẩm chất, năng lực đáp ứng yêu cầu, nhiệm vụ; phát huy dân chủ, tăng \ncường trách nhiệm, kỷ luật, kỷ cương; đẩy mạnh đấu tranh phòng, chống tham nhũng, \nlãng phí, quan liêu, tệ nạn xã hội và tội phạm.\n(11) Xây dựng Đảng trong sạch, vững mạnh, nâng cao năng lực lãnh đạo, tăng \ncường bản chất giai cấp công nhân và tính tiên phong, sức chiến đấu, phát huy truyền \nthống đoàn kết, thống nhất của Đảng; ngăn chặn, đẩy lùi tình trạng suy thoái về tư \ntưởng chính trị, đạo đức, lối sống, những biểu hiện \"tự diễn biến\", \"tự chuyển hóa\" \ntrong nội bộ. Đổi mới mạnh mẽ công tác cán bộ, coi trọng công tác bảo vệ Đảng, bảo \nvệ chính trị nội bộ; tăng cường và nâng cao chất lượng công tác tư tưởng, lý luận, công \n65\ntác kiểm tra, giám sát và công tác dân vận của Đảng; tiếp tục đổi mới phương thức \nlãnh đạo của Đảng.\n(12) Tiếp tục quán triệt và xử lý tốt các quan hệ lớn: quan hệ giữa đổi mới, ổn \nđịnh và phát triển; giữa đổi mới kinh tế và đổi mới chính trị; giữa tuân theo các quy \nluật thị trường và bảo đảm định hướng xã hội chủ nghĩa; giữa phát triển lực lượng sản \nxuất và xây dựng, hoàn thiện từng bước quan hệ sản xuất xã hội chủ nghĩa; giữa Nhà \nnước và thị trường; giữa tăng trưởng kinh tế và phát triển văn hóa, thực hiện tiến bộ và \ncông bằng xã hội; giữa xây dựng chủ nghĩa xã hội và bảo vệ Tổ quốc xã hội chủ nghĩa; \ngiữa độc lập, tự chủ và hội nhập quốc tế; giữa Đảng lãnh đạo, Nhà nước quản lý, nhân \ndân làm chủ;...\nĐại hội XII cũng xác định 9 mối quan hệ lớn cần nhận thức và giải quyết: Quan \nhệ giữa đổi mới, ổn định và phát triển; giữa đổi mới kinh tế và đổi mới chính trị; giữa \ntuân theo các quy luật thị trường và bảo đảm định hướng xã hội chủ nghĩa; giữa phát \ntriển lực lượng sản xuất và xây dựng, hoàn thiện từng bước quan hệ sản xuất xã hội \nchủ nghĩa; giữa Nhà nước và thị trường; giữa tăng trưởng kinh tế và phát triển văn \nhóa, thực hiện tiến bộ và công bằng xã hội; giữa xây dựng chủ nghĩa xã hội và bảo vệ\nTổ quốc xã hội chủ nghĩa; giữa độc lập, tự chủ và hội nhập quốc tế; giữa Đảng lãnh \nđạo, Nhà nước quản lý, nhân dân làm chủ.\nC. CÂU HỎI ÔN TẬP\n1. Phân tích điều kiện ra đời và những đặc trưng của chủ nghĩa xã hội? Liên hệ\nvới thực tiễn Việt Nam?\n2. Phân tích tính tất yếu, đặc điểm của thời kỳ quá độ lên chủ nghĩa xã hội? \nLiên hệ Việt Nam?\n3. Phân tích luận điểm của Đảng Cộng sản Việt Nam về con đường đi lên của \nnước ta là sự phát triển quá độ lên chủ nghĩa xã hội bỏ qua chế độ tư bản chủ nghĩa? \nDANH MỤC TÀI LIỆU THAM KHẢO\n1. Đảng Cộng sản Việt Nam, Cương lĩnh xây dựng đất nước trong thời kỳ quá \nđộ lên chủ nghĩa xã hội. Nhà xuất bản Sự Thật, Hà Nội, 1991.\n2. Đảng Cộng sản Việt Nam, Cương lĩnh xây dựng đất nước trong thời kỳ quá \nđộ lên chủ nghĩa xã hội (Bổ sung và phát triển năm 2011,Nhà xuất bản Sự Thật, Hà \nNội 2011.\n3. Hội đồng trung ương chỉ đạo biên soạn giáo trình quốc gia các bộ môn Mác -\nLênin, Tư tưởng Hồ Chí Minh, Giáo trình chủ nghĩa xã hội. Nhà xuất bản Chính trị\nQuốc gia, Hà Nội, 2002.\n66\n4. GS.TS Phùng Hữu Phú, GS, TS Lê Hữu Nghĩa, GS.TS Vũ Văn Hiền, \nPGS.TS Nguyễn Viết Thông… (đồng chủ biên), Một số vấn đề lý luận - thực tiễn về\nchủ nghĩa xã hội và con đường đi lên chủ nghĩa xã hội ở Việt Nam qua 30 năm đổi \nmới. Nhà xuất bản Chính trị Quốc gia, Hà Nội, 2016.\n5. Học viện Chính trị quốc gia Hồ Chí Minh, Giáo trình Chủ nghĩa xã hội khoa \nhọc, dành cho hệ cao cấp lý luận chính trị, H.2018.\n67"
    }
  ],
  "embeddings": [
    [
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12
    ],
    [
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243,
      0.243
    ],
    [
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603,
      0.603
    ],
    [
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12,
      0.12
    ]
  ]
}